webpackJsonp([7],{

/***/ "1uSB":
/***/ (function(module, exports, __webpack_require__) {

// style-loader: Adds some css to the DOM by adding a <style> tag

// load the styles
var content = __webpack_require__("xbAv");
if(typeof content === 'string') content = [[module.i, content, '']];
if(content.locals) module.exports = content.locals;
// add the styles to the DOM
var add = __webpack_require__("rjj0").default
var update = add("77377717", content, false, {});
// Hot Module Replacement
if(false) {
 // When the styles change, update the <style> tags
 if(!content.locals) {
   module.hot.accept("!!../../node_modules/css-loader/index.js?{\"minimize\":false,\"sourceMap\":true}!../../node_modules/vue-loader/lib/style-compiler/index.js?{\"optionsId\":\"0\",\"vue\":true,\"scoped\":false,\"sourceMap\":true}!../../node_modules/stylus-loader/index.js?{\"sourceMap\":true}!../../node_modules/vue-loader/lib/selector.js?type=styles&index=0!./casePageForm.vue", function() {
     var newContent = require("!!../../node_modules/css-loader/index.js?{\"minimize\":false,\"sourceMap\":true}!../../node_modules/vue-loader/lib/style-compiler/index.js?{\"optionsId\":\"0\",\"vue\":true,\"scoped\":false,\"sourceMap\":true}!../../node_modules/stylus-loader/index.js?{\"sourceMap\":true}!../../node_modules/vue-loader/lib/selector.js?type=styles&index=0!./casePageForm.vue");
     if(typeof newContent === 'string') newContent = [[module.id, newContent, '']];
     update(newContent);
   });
 }
 // When the module is disposed, remove the <style> tags
 module.hot.dispose(function() { update(); });
}

/***/ }),

/***/ "xbAv":
/***/ (function(module, exports, __webpack_require__) {

exports = module.exports = __webpack_require__("FZ+f")(true);
// imports


// module
exports.push([module.i, "\n.CaseText {\n  line-height: 2.2;\n}\n.CaseDialog1 {\n  padding-bottom: 20px;\n  padding-left: 0px;\n  font-style: normal;\n}\n.CaseDialog2 {\n  padding-bottom: 20px;\n  padding-left: 100px;\n  font-style: italic;\n  font-weight: bold;\n}\n.CaseAnswerItem {\n  font-style: italic;\n  font-weight: 400;\n}\n/*# sourceMappingURL=src/pages/casePageForm.css.map */", "", {"version":3,"sources":["D:/Projects/GTiBE/MainPortalApp/QuasarApp/src/pages/src/css/themes/common.variables.styl","D:/Projects/GTiBE/MainPortalApp/QuasarApp/src/pages/casePageForm.vue","D:/Projects/GTiBE/MainPortalApp/QuasarApp/src/pages/src/pages/casePageForm.vue"],"names":[],"mappings":";AAyBA;EACE,iBAAA;CCxBD;AC+FD;EACE,qBAAA;EACA,kBAAA;EACA,mBAAA;CD7FD;AC8FD;EACE,qBAAA;EACA,oBAAA;EACA,mBAAA;EACA,kBAAA;CD5FD;AC8FD;EACE,mBAAA;EACA,iBAAA;CD5FD;AACD,sDAAsD","file":"casePageForm.vue","sourcesContent":["// App Shared Variables\n// --------------------------------------------------\n// To customize the look and feel of this app, you can override\n// the Stylus variables found in Quasar's source Stylus files. Setting\n// variables before Quasar's Stylus will use these variables rather than\n// Quasar's default Stylus variable values. Stylus variables specific\n// to the themes belong in either the variables.ios.styl or variables.mat.styl files.\n\n// Check documentation for full list of Quasar variables\n\n\n// App Shared Color Variables\n// --------------------------------------------------\n// It's highly recommended to change the default colors\n// to match your app's branding.\n\n$primary   = #027be3\n$secondary = #661a7d\n$tertiary  = #555\n\n$neutral   = #E0E1E2\n$positive  = #21BA45\n$negative  = #DB2828\n$info      = #31CCEC\n$warning   = #F2C037\n.CaseText \n  line-height 2.2",".CaseText {\n  line-height: 2.2;\n}\n.CaseDialog1 {\n  padding-bottom: 20px;\n  padding-left: 0px;\n  font-style: normal;\n}\n.CaseDialog2 {\n  padding-bottom: 20px;\n  padding-left: 100px;\n  font-style: italic;\n  font-weight: bold;\n}\n.CaseAnswerItem {\n  font-style: italic;\n  font-weight: 400;\n}\n/*# sourceMappingURL=src/pages/casePageForm.css.map */","\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n@import '~variables'\n.CaseDialog1\n  padding-bottom 20px\n  padding-left 0px\n  font-style normal \n.CaseDialog2\n  padding-bottom 20px\n  padding-left 100px\n  font-style italic\n  font-weight bold\n\n.CaseAnswerItem  \n  font-style italic  \n  font-weight 400  \n"],"sourceRoot":""}]);

// exports


/***/ }),

/***/ "z40W":
/***/ (function(module, __webpack_exports__, __webpack_require__) {

"use strict";
Object.defineProperty(__webpack_exports__, "__esModule", { value: true });

// CONCATENATED MODULE: ./src/assets/case-data.js
/* harmony default export */ var case_data = ([{
  name: 'Frozen Yogurt',
  calories: 159,
  fat: 6.0,
  carbs: 24,
  protein: 4.0,
  sodium: 87,
  calcium: '14%',
  iron: '1%'
}, {
  name: 'Ice cream sandwich',
  calories: 237,
  fat: 9.0,
  carbs: 37,
  protein: 4.3,
  sodium: 129,
  calcium: '8%',
  iron: '1%'
}, {
  name: 'Eclair',
  calories: 262,
  fat: 16.0,
  carbs: 23,
  protein: 6.0,
  sodium: 337,
  calcium: '6%',
  iron: '7%'
}, {
  name: 'Cupcake',
  calories: 305,
  fat: 3.7,
  carbs: 67,
  protein: 4.3,
  sodium: 413,
  calcium: '3%',
  iron: '8%'
}, {
  name: 'Gingerbread',
  calories: 356,
  fat: 16.0,
  carbs: 49,
  protein: 3.9,
  sodium: 327,
  calcium: '7%',
  iron: '16%'
}, {
  name: 'Jelly bean',
  calories: 375,
  fat: 0.0,
  carbs: 94,
  protein: 0.0,
  sodium: 50,
  calcium: '0%',
  iron: '0%'
}, {
  name: 'Lollipop',
  calories: 392,
  fat: 0.2,
  carbs: 98,
  protein: 0,
  sodium: 38,
  calcium: '0%',
  iron: '2%'
}, {
  name: 'Honeycomb',
  calories: 408,
  fat: 3.2,
  carbs: 87,
  protein: 6.5,
  sodium: 562,
  calcium: '0%',
  iron: '45%'
}, {
  name: 'Donut',
  calories: 452,
  fat: 25.0,
  carbs: 51,
  protein: 4.9,
  sodium: 326,
  calcium: '2%',
  iron: '22%'
}, {
  name: 'KitKat',
  calories: 518,
  fat: 26.0,
  carbs: 65,
  protein: 7,
  sodium: 54,
  calcium: '12%',
  iron: '6%'
}]);
// CONCATENATED MODULE: ./src/assets/CaseParameters.js
/* harmony default export */ var CaseParameters = ([{
  ModuleNodeId: 'app1D1',
  ModuleNodeIndex: 0,
  ModuleNodeText: '<div class=\'CaseDialog1\' >\n\u0412\u044B, \u0443\u043B\u044B\u0431\u043D\u0443\u0432\u0448\u0438\u0441\u044C \u0441\u0435\u043A\u0440\u0435\u0442\u0430\u0440\u0448\u0435, \u043F\u0440\u043E\u0448\u043B\u0438 \u043F\u0440\u044F\u043C\u0438\u043A\u043E\u043C \u043A \u043A\u0430\u0431\u0438\u043D\u0435\u0442\u0443 \u0421\u0430\u043C\u0435\u0434\u043E\u0432\u0430 \u0438, \u0437\u0430\u0433\u043B\u044F\u043D\u0443\u0432 \u0432\u043D\u0443\u0442\u0440\u044C, \u0443\u0432\u0438\u0434\u0435\u043B\u0438, \u0447\u0442\u043E \u043E\u043D \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442, \u0441\u043A\u043B\u043E\u043D\u0438\u0432\u0448\u0438\u0441\u044C \u043D\u0430\u0434 \u0431\u0443\u043C\u0430\u0433\u0430\u043C\u0438. \n</div>\n<div class=\'CaseDialog2\' >\n-\t\u0412\u0438\u043A\u0442\u043E\u0440 \u0418\u0432\u0430\u043D\u043E\u0432\u0438\u0447, \u0434\u043E\u0431\u0440\u044B\u0439 \u0434\u0435\u043D\u044C. \u0411\u0435\u043B\u043E\u043A\u043E\u043D\u044C \u0431\u0435\u0441\u043F\u043E\u043A\u043E\u0438\u0442. \u041D\u0435 \u043E\u0442\u0432\u043B\u0435\u043A\u0430\u044E? \u0417\u0430\u0439\u0434\u0443 \u043D\u0430 5 \u043C\u0438\u043D\u0443\u0442? \n</div>\n<div class=\'CaseDialog1\' >\n\u0421\u0430\u043C\u0435\u0434\u043E\u0432 \u043F\u043E\u0434\u043D\u044F\u043B \u0433\u043E\u043B\u043E\u0432\u0443 \u0438 \u043C\u043E\u043B\u0447\u0430 \u0441\u043C\u043E\u0442\u0440\u0438\u0442 \u043D\u0430 \u0432\u0430\u0441, \u043D\u0438\u043A\u0430\u043A \u043D\u0435 \u043E\u0442\u0432\u0435\u0447\u0430\u044F \u043D\u0430 \u043F\u0440\u0438\u0432\u0435\u0442\u0441\u0442\u0432\u0438\u0435. \u0412\u044B \u0438\u0441\u0442\u043E\u043B\u043A\u043E\u0432\u044B\u0432\u0430\u0435\u0442\u0435 \u044D\u0442\u043E \u043A\u0430\u043A \u043F\u0440\u0438\u0433\u043B\u0430\u0448\u0435\u043D\u0438\u0435 \u0432\u043E\u0439\u0442\u0438 \u0438, \u0437\u0430\u043A\u0440\u044B\u0432 \u0434\u0432\u0435\u0440\u044C \u0437\u0430 \u0441\u043E\u0431\u043E\u0439, \u043F\u0440\u043E\u0445\u043E\u0434\u0438\u0442\u0435 \u0432 \u043A\u0430\u0431\u0438\u043D\u0435\u0442. \n\u041F\u0440\u0438\u0441\u0435\u0432 \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u0421\u0430\u043C\u0435\u0434\u043E\u0432\u0430 \u0438 \u043F\u043E\u0436\u0430\u0432 \u0435\u043C\u0443 \u0440\u0443\u043A\u0443, \u0432\u044B \u043D\u0430\u0447\u0438\u043D\u0430\u0435\u0442\u0435 \u0441 \u043C\u0435\u0441\u0442\u0430 \u0432 \u043A\u0430\u0440\u044C\u0435\u0440. \n</div>\n<div class=\'CaseDialog2\' >\n-\t\u0412\u0438\u043A\u0442\u043E\u0440 \u0418\u0432\u0430\u043D\u043E\u0432\u0438\u0447, \u043A\u0430\u043A \u0432\u044B \u0437\u043D\u0430\u0435\u0442\u0435, \u0413\u0435\u043D\u0435\u0440\u0430\u043B\u044C\u043D\u044B\u0439 \u043F\u043E\u0440\u0443\u0447\u0438\u043B \u043C\u043D\u0435 \u043D\u0430\u0447\u0430\u0442\u044C \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0443 \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u043F\u043E \u0432\u043D\u0435\u0434\u0440\u0435\u043D\u0438\u044E \u0432 \u043A\u043E\u043C\u043F\u0430\u043D\u0438\u0438 \u0438\u043D\u0441\u0442\u0440\u0443\u043C\u0435\u043D\u0442\u043E\u0432 3D \u043C\u043E\u0434\u0435\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0438 \u043F\u0440\u043E\u0435\u043A\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0432\u0441\u0435\u0445 \u0440\u0430\u0431\u043E\u0442 \u043F\u043E \u043E\u0431\u0443\u0441\u0442\u0440\u043E\u0439\u0441\u0442\u0432\u0443 \u0433\u0430\u0437\u043E\u0442\u0440\u0430\u043D\u0441\u043F\u043E\u0440\u0442\u043D\u043E\u0439 \u0438\u043D\u0444\u0440\u0430\u0441\u0442\u0440\u0443\u043A\u0442\u0443\u0440\u044B. \u042F \u0443\u0432\u0435\u0440\u0435\u043D, \u0447\u0442\u043E \u0431\u0435\u0437 \u0432\u0430\u0448\u0435\u0433\u043E \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u044F \u044D\u0442\u0430 \u0440\u0430\u0431\u043E\u0442\u0430 \u0431\u0443\u0434\u0435\u0442 \u043F\u0440\u043E\u0445\u043E\u0434\u0438\u0442\u044C, \u043D\u0435 \u0442\u0430\u043A \u043B\u0435\u0433\u043A\u043E, \u0431\u044B\u0441\u0442\u0440\u043E \u0438 \u043A\u0430\u0447\u0435\u0441\u0442\u0432\u0435\u043D\u043D\u043E, \u043A\u0430\u043A \u043C\u044B \u0441\u0442\u0440\u0435\u043C\u0438\u043C\u0441\u044F, \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \u043F\u0440\u0438\u0448\u0435\u043B \u043A \u0432\u0430\u043C, \u0447\u0442\u043E\u0431\u044B, \u0442\u0430\u043A \u0441\u043A\u0430\u0437\u0430\u0442\u044C, \u043D\u0435\u043E\u0444\u0438\u0446\u0438\u0430\u043B\u044C\u043D\u043E \u043E\u0431\u0441\u0443\u0434\u0438\u0442\u044C, \u043A\u0430\u043A \u043C\u044B \u043C\u043E\u0436\u0435\u043C \u0432\u043C\u0435\u0441\u0442\u0435 \u043E\u0440\u0433\u0430\u043D\u0438\u0437\u043E\u0432\u0430\u0442\u044C \u0440\u0430\u0431\u043E\u0442\u0443 \u043F\u043E \u044D\u0442\u043E\u043C\u0443 \u043F\u0440\u043E\u0435\u043A\u0442\u0443. \u0427\u0442\u043E \u0441\u043A\u0430\u0436\u0435\u0442\u0435? \n</div>\n<div class=\'CaseDialog1\' >\n\u0412\u0438\u043A\u0442\u043E\u0440 \u0418\u0432\u0430\u043D\u043E\u0432\u0438\u0447, \u043C\u043E\u043B\u0447\u0430 \u043E\u0442\u043B\u043E\u0436\u0438\u043B \u0432 \u0441\u0442\u043E\u0440\u043E\u043D\u0443 \u0441\u0432\u043E\u0438 \u0431\u0443\u043C\u0430\u0433\u0438, \u0442\u044F\u0436\u0435\u043B\u043E \u0432\u0437\u0434\u043E\u0445\u043D\u0443\u043B \u0438, \u043D\u0435\u043E\u0436\u0438\u0434\u0430\u043D\u043D\u043E \u043D\u0430 \u043F\u043E\u0432\u044B\u0448\u0435\u043D\u043D\u043E\u043C \u0442\u043E\u043D\u0435, \u043E\u0442\u0432\u0435\u0442\u0438\u043B \u0432\u0430\u043C \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C:\n</div>\n<div class=\'CaseDialog2\' >\n-\t\u0421\u0432\u044F\u0442\u043E\u0441\u043B\u0430\u0432 \u0410\u043D\u0434\u0440\u0435\u0435\u0432\u0438\u0447, \u0443 \u043C\u0435\u043D\u044F \u0437\u0434\u0435\u0441\u044C, \u0432 \u043E\u0442\u043B\u0438\u0447\u0438\u0435 \u043E\u0442 \u0432\u0430\u0448\u0438\u0445 \u0431\u0438\u0440\u044E\u043B\u0435\u043A, \u0440\u0435\u0430\u043B\u044C\u043D\u044B\u0435 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u044B \u043F\u043E \u0440\u0435\u0430\u043B\u044C\u043D\u044B\u043C \u043F\u0440\u043E\u0435\u043A\u0442\u0430\u043C. \u042F \u043B\u043E\u043C\u0430\u044E \u0433\u043E\u043B\u043E\u0432\u0443, \u043A\u0430\u043A \u0443\u0441\u043F\u0435\u0442\u044C \u0432 \u0441\u0440\u043E\u043A \u0441\u0434\u0430\u0442\u044C \u0442\u0440\u0438 \u043F\u0440\u043E\u0435\u043A\u0442\u0430, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u0443\u0441\u043F\u0435\u0448\u043D\u043E \u0437\u0430\u0432\u0430\u043B\u0438\u043B\u0438 \u043D\u0430\u0448\u0438 \u0441\u043C\u0435\u0436\u043D\u0438\u043A\u0438 \u043F\u0440\u0438 \u0430\u043A\u0442\u0438\u0432\u043D\u043E\u043C \u0443\u0447\u0430\u0441\u0442\u0438\u0438 \u0432\u0430\u0448\u0438\u0445 \u0431\u043E\u0439\u0446\u043E\u0432, \u0430 \u0432\u044B \u0432\u043B\u0430\u043C\u044B\u0432\u0430\u0435\u0442\u0435\u0441\u044C \u0431\u0435\u0437 \u0441\u043F\u0440\u043E\u0441\u0430 \u0432 \u043C\u043E\u0439 \u043A\u0430\u0431\u0438\u043D\u0435\u0442, \u043E\u0442\u0432\u043B\u0435\u043A\u0430\u0435\u0442\u0435 \u043E\u0442 \u0440\u0430\u0431\u043E\u0442\u044B \u0438 \u0435\u0449\u0435 \u0438\u043C\u0435\u0435\u0442\u0435 \u043D\u0430\u0433\u043B\u043E\u0441\u0442\u044C \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0442\u044C \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u0447\u0435\u0441\u0442\u0432\u043E. \u0421\u043D\u0430\u0447\u0430\u043B\u0430 \u043D\u0430\u0432\u0435\u0434\u0438\u0442\u0435 \u0443 \u0441\u0435\u0431\u044F \u043F\u043E\u0440\u044F\u0434\u043E\u043A \u0438 \u043D\u0430\u0443\u0447\u0438\u0442\u0435\u0441\u044C \u0437\u0430\u043F\u0438\u0441\u044B\u0432\u0430\u0442\u044C\u0441\u044F \u043D\u0430 \u043F\u0440\u0438\u0435\u043C. \u0412\u0430\u043C \u0432\u0441\u0435 \u043F\u043E\u043D\u044F\u0442\u043D\u043E?  \u0412\u043E\u043F\u0440\u043E\u0441\u044B \u0435\u0441\u0442\u044C?  \n</div>\n<div class=\'CaseDialog1\' >\n\u0412\u044B \u043D\u0430 \u043C\u0433\u043D\u043E\u0432\u0435\u043D\u0438\u0435 \u043E\u043F\u0435\u0448\u0438\u043B\u0438 \u043E\u0442 \u0442\u0430\u043A\u043E\u0433\u043E \u043D\u0430\u0447\u0430\u043B\u0430, \u043D\u043E \u043E\u0447\u0435\u0432\u0438\u0434\u043D\u043E, \u0447\u0442\u043E \u043D\u0430 \u0442\u0430\u043A\u043E\u0439 \u0432\u044B\u043F\u0430\u0434 \u043D\u0443\u0436\u043D\u043E \u043A\u0430\u043A \u0442\u043E \u043E\u0442\u0432\u0435\u0447\u0430\u0442\u044C. \n</div>   ',
  ModuleNodeParams: [{
    ActionID: 'app1D1R1',
    ActionIdx: 1,
    ActionText: ' - Виктор Иванович, что за наезды, когда мои люди сорвали хоть один проект, вы вообще в адекватном состоянии!?',
    ActionBall: 2,
    ActionComment: 'Резервист, отвечая агрессией на агрессию, повышает градус конфликта',
    ActionNext: 3
  }, {
    ActionID: 'app1D1R2',
    ActionIdx: 2,
    ActionText: ' - Ого, Виктор Иванович, вот это напор, я даже растерялся на секунду. Хорошо, что у нас не 18 век на дворе, а то пришлось бы уже секундантов выбирать.',
    ActionBall: 3,
    ActionComment: 'Резервист применяет технику «Гипертрофии смущения», манипуляторный прием регуляции эмоционального напряжения оппонента. Не дав себя вовлечь в агрессивный «размен ударами», он создает себе плацдарм для дальнейшего мягкого сопротивления в коммуникации.',
    ActionNext: 2
  }, {
    ActionID: 'app1D1R3',
    ActionIdx: 3,
    ActionText: ' - Виктор Иванович, вы уверены, что продуктивно вот так с порога орать на коллегу?',
    ActionBall: 3,
    ActionComment: 'Резервист, отвечая агрессией на агрессию, повышает градус конфликта',
    ActionNext: 3
  }, {
    ActionID: 'app1D1R4',
    ActionIdx: 4,
    ActionText: ' - Виктор Иванович, мы же с вами на работе… Мы же коллеги… Когда на меня кричат, я обычно теряюсь и не могу ни о чем другом больше думать. Поэтому давайте тогда уж на месте решим проблему. Я ваши обвинения услышал, но на чем конкретно вы сделали такие выводы? Я готов к конструктивному диалогу.',
    ActionBall: 5,
    ActionComment: 'Резервист применяет коммуникативные приемы «Вы посыл», «Я – высказывание». Не дав себя вовлечь в агрессивный «размен ударами», он создает себе плацдарм для дальнейшего мягкого сопротивления в коммуникации.',
    ActionNext: 2
  }]
}, {
  ModuleNodeId: 'app1D2',
  ModuleNodeIndex: 1,
  ModuleNodeText: '   <div class="CaseDialog1" >\n  \u0421\u0430\u043C\u0435\u0434\u043E\u0432, \u043A\u0430\u0437\u0430\u043B\u043E\u0441\u044C \u0431\u044B, \u043D\u0435\u043C\u043D\u043E\u0433\u043E \u0443\u0441\u043F\u043E\u043A\u043E\u0438\u043B\u0441\u044F \u043F\u043E\u0441\u043B\u0435 \u0432\u0430\u0448\u0438\u0445 \u0432\u0437\u0432\u0435\u0448\u0435\u043D\u043D\u044B\u0445 \u043E\u0442\u0432\u0435\u0442\u043E\u0432, \u0438 \u043D\u0435\u043C\u043D\u043E\u0433\u043E \u0432\u043E\u0440\u0447\u043B\u0438\u0432\u043E \u0437\u0430\u043C\u0435\u0442\u0438\u043B.\n </div>\n <div class="CaseDialog2" >\n -\t\u042F \u0441\u043B\u044B\u0448\u0430\u043B, \u0421\u0432\u044F\u0442\u043E\u0441\u043B\u0430\u0432 \u0410\u043D\u0434\u0440\u0435\u0435\u0432\u0438\u0447, \u0447\u0442\u043E \u0443 \u043D\u0430\u0441 \u043D\u0435\u0434\u0430\u0432\u043D\u043E \u0442\u0440\u0435\u043D\u0438\u043D\u0433 \u043E\u0440\u0433\u0430\u043D\u0438\u0437\u043E\u0432\u044B\u0432\u0430\u043B\u0438 \u043F\u043E \u044D\u0444\u0444\u0435\u043A\u0442\u0438\u0432\u043D\u044B\u043C \u043A\u043E\u043C\u043C\u0443\u043D\u0438\u043A\u0430\u0446\u0438\u044F\u043C, \u043A\u043E\u0440\u043E\u0447\u0435 \u043F\u043E \u0442\u043E\u043C\u0443, \u043A\u0430\u043A \u043A\u0440\u0430\u0441\u0438\u0432\u043E \u044F\u0437\u044B\u043A\u043E\u043C \u0431\u043E\u043B\u0442\u0430\u0442\u044C? \u0412\u044B, \u044F \u0441\u043C\u043E\u0442\u0440\u044E, \u0442\u043E\u0436\u0435 \u0442\u0430\u043C \u0432\u0440\u0435\u043C\u044F \u0442\u0435\u0440\u044F\u043B\u0438, \u0430 \u0442\u0435\u043F\u0435\u0440\u044C \u043D\u0430 \u043C\u043D\u0435 \u0442\u0440\u0435\u043D\u0438\u0440\u0443\u0435\u0442\u0435\u0441\u044C?\n </div>\n ',
  ModuleNodeParams: [{
    ActionID: 'app1D2R1',
    ActionIdx: 1,
    ActionText: 'Виктор Иванович, (вы улыбаетесь и находите контакт глаз)! Да, я был на этом тренинге, но признаться откровенно те как бы «сложные» ситуации, что мы там отрабатывали и рядом не стояли с вашим умением взбодрить с порога. Перейдем к делу, быть может?',
    ActionBall: 4,
    ActionComment: 'Резервист грамотно применяет техники регуляции эмоционального напряжения. Дает выпустить пар оппоненту и не поддается на провокации. В нужной мере использует комплимент.',
    ActionNext: 5
  }, {
    ActionID: 'app1D2R2',
    ActionIdx: 2,
    ActionText: 'Виктор Иванович, (вы улыбаетесь и находите контакт глаз) совершенно верно, был я на этом тренинге. Честно говоря, считаю, что зря время потерял. Эти тренинги и близко к реальной жизни не стоят. Перейдем к делу, быть может?',
    ActionBall: 2,
    ActionComment: 'Резервист частично применяет техники регуляции эмоционального напряжения, пытается разрядить обстановку, но это можно было бы сделать и более успешно.',
    ActionNext: 5
  }, {
    ActionID: 'app1D2R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович, (вы улыбаетесь и находите контакт глаз)! Да эти тренинги и близко к реальной жизни не стоят. Перейдем к делу, быть может?',
    ActionBall: 3,
    ActionComment: 'Резервист грамотно применяет техники регуляции эмоционального напряжения. Дает выпустить пар оппоненту и не поддается на провокации.',
    ActionNext: 5
  }, {
    ActionID: 'app1D2R4',
    ActionIdx: 4,
    ActionText: 'Виктор Иванович, (вы улыбаетесь и находите контакт глаз)! Да эти тренинги и близко к реальной жизни не стоят. Вот чей бы тренинг по переговорам я, и правда, посетил, так это ваш. До сих пор помню, как вы подрядчиков разносили в 2015, а сейчас только убедился в этом. Ну, пар мы выпустили. Я искренне считаю, что без вашей экспертизы, Виктор Иванович, мы с этим, крайне важным для Компании проектом не справимся.  Перейдем к делу, быть может? ',
    ActionBall: 5,
    ActionComment: 'Резервист грамотно применяет техники регуляции эмоционального напряжения. Дает выпустить пар оппоненту и не поддается на провокации. В нужной мере использует комплимент. Использует прием подчеркивания «значимости человека в прошлом и будущем».',
    ActionNext: 5
  }]
}, {
  ModuleNodeId: 'app1D3',
  ModuleNodeIndex: 2,
  ModuleNodeText: '   <div class="CaseDialog1" >\n  \u0412\u0438\u043A\u0442\u043E\u0440 \u0418\u0432\u0430\u043D\u043E\u0432\u0438\u0447, \u043A\u0430\u0437\u0430\u043B\u043E\u0441\u044C, \u043D\u0430 \u0441\u0435\u043A\u0443\u043D\u0434\u0443 \u043F\u043E\u0442\u0435\u0440\u044F\u043B \u0434\u0430\u0440 \u0440\u0435\u0447\u0438 \u043F\u043E\u0441\u043B\u0435 \u0432\u0430\u0448\u0435\u0433\u043E \u043E\u0442\u0432\u0435\u0442\u0430, \u043D\u043E \u043F\u043E\u0442\u043E\u043C, \u0434\u0430\u0436\u0435 \u043F\u0440\u0438\u0432\u0441\u0442\u0430\u0432 \u043D\u0430 \u0441\u0435\u043A\u0443\u043D\u0434\u0443 \u0441\u043E \u0441\u0432\u043E\u0435\u0433\u043E \u043A\u0440\u0435\u0441\u043B\u0430, \u0432\u044B\u0434\u0430\u043B \u0433\u043D\u0435\u0432\u043D\u0443\u044E \u0442\u0438\u0440\u0430\u0434\u0443, \u0432\u043F\u0440\u043E\u0447\u0435\u043C, \u0442\u043E\u043D \u043E\u043D \u0438 \u043F\u0440\u0430\u0432\u0434\u0430, \u0447\u0443\u0442\u044C \u0441\u043D\u0438\u0437\u0438\u043B:\n </div>\n <div class="CaseDialog2" >\n - \u0421\u0432\u044F\u0442\u043E\u0441\u043B\u0430\u0432 \u0410\u043D\u0434\u0440\u0435\u0435\u0432\u0438\u0447. \u0412\u044B \u0430\u0431\u0441\u043E\u043B\u044E\u0442\u043D\u043E \u043D\u0435 \u0443\u043C\u0435\u0435\u0442\u0435 \u0441\u0435\u0431\u044F \u0432\u0435\u0441\u0442\u0438 \u0432 \u043E\u0431\u0449\u0435\u043D\u0438\u0438 \u0441 \u0432\u044B\u0441\u0448\u0438\u043C \u0440\u0443\u043A\u043E\u0432\u043E\u0434\u0441\u0442\u0432\u043E\u043C \u0438 \u0441\u0442\u0430\u0440\u0448\u0438\u043C\u0438 \u043A\u043E\u043B\u043B\u0435\u0433\u0430\u043C\u0438. \u0412\u044B \u0438 \u0432\u0430\u0448\u0438 \u043F\u043E\u0434\u0447\u0438\u043D\u0435\u043D\u043D\u044B\u0435 \u043F\u043E\u0441\u0442\u043E\u044F\u043D\u043D\u043E \u043A\u0440\u0438\u0442\u0438\u043A\u0443\u0435\u0442\u0435 \u0434\u0440\u0443\u0433\u0438\u0445, \u043D\u043E \u043D\u0438 \u0440\u0430\u0437\u0443 \u0441\u0430\u043C\u0438 \u043D\u0435 \u0434\u043E\u0432\u0435\u043B\u0438 \u043D\u0438 \u043E\u0434\u0438\u043D \u043F\u0440\u043E\u0435\u043A\u0442 \u0434\u043E \u043A\u043E\u043D\u0446\u0430. \u041E\u0447\u0435\u0432\u0438\u0434\u043D\u043E, \u0447\u0442\u043E \u043D\u0430 \u0442\u0435\u043A\u0443\u0449\u0435\u043C \u044D\u0442\u0430\u043F\u0435 \u0443 \u044D\u0442\u043E\u0439 \u0438\u0434\u0435\u0438 \u043F\u0440\u043E\u0441\u0442\u043E \u043D\u0438\u043A\u0430\u043A\u0438\u0445 \u043F\u0435\u0440\u0441\u043F\u0435\u043A\u0442\u0438\u0432 \u0432 \u043D\u0430\u0448\u0435\u0439 \u043E\u0440\u0433\u0430\u043D\u0438\u0437\u0430\u0446\u0438\u0438 \u043D\u0435\u0442, \u0438, \u0432\u043E\u043E\u0431\u0449\u0435, \u0437\u0430\u0447\u0435\u043C \u043D\u0430\u043C \u044D\u0442\u043E\u0442 \u043F\u0440\u043E\u0435\u043A\u0442 \u0432 \u043F\u0440\u0438\u043D\u0446\u0438\u043F\u0435, \u043D\u0430\u043C, \u0447\u0442\u043E \u043D\u0430\u0434\u0435\u0436\u043D\u044B\u0435 \u043C\u0435\u0442\u043E\u0434\u044B \u0443\u0436\u0435 \u043D\u0430\u0434\u043E\u0435\u043B\u0438? \u041C\u044B \u043E\u043F\u044F\u0442\u044C \u043F\u043E\u0442\u0440\u0430\u0442\u0438\u043C \u043C\u0438\u043B\u043B\u0438\u043E\u043D\u044B \u0440\u0443\u0431\u043B\u0435\u0439, \u0430 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442  \u043F\u0448\u0438\u043A!  \u0417\u0430 \u043A\u0430\u043A\u0438\u043C \u0447\u0435\u0440\u0442\u043E\u043C \u0432\u044B \u0432\u043E\u043E\u0431\u0449\u0435  \u043A\u043E \u043C\u043D\u0435 \u043F\u0440\u0438\u043F\u0435\u0440\u043B\u0438\u0441\u044C \u0441 \u044D\u0442\u043E\u0439 \u0438\u0434\u0435\u0435\u0439, \u0438\u0434\u0438\u0442\u0435 \u043A \u0418\u0422-\u0448\u043D\u0438\u043A\u0430\u043C! \n </div>\n  ',
  ModuleNodeParams: [{
    ActionID: 'app1D3R1',
    ActionIdx: 1,
    ActionText: 'Знаете, Виктор Иванович, вы вроде взрослый мужик, а ведете себя как на базаре. Я вернусь, когда вы успокоитесь или встретимся у Генерального директора! ',
    ActionBall: 2,
    ActionComment: 'Резервист неоправданно сорвался в коммуникации. Дальнейшее продолжение беседы бессмысленно, придется начать упражнение заново.',
    ActionNext: 1
  }, {
    ActionID: 'app1D3R2',
    ActionIdx: 2,
    ActionText: 'Виктор Иванович, давайте уже с вами определимся, вы тут дальше будете агрессию демонстрировать и рассказывать, как я плохо работаю или сделаем перерыв и поговорим по существу поручения Генерального директора? ',
    ActionBall: 3,
    ActionComment: 'Несмотря на то, что этот вариант ответа, в принципе, не так уж и плох, после него беседа, очевидно, зайдет в тупик. Дальнейшее продолжение коммуникации бессмысленно, придется начать упражнение заново.',
    ActionNext: 1
  }, {
    ActionID: 'app1D3R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович, я согласен с вами, что в отношениях между нашими подразделениями не всегда все проходит гладко, однако я бы не стал так уверенно утверждать, что мы не довели ни один проект до конца.  В конце концов, не далее как в прошлом квартале, мы успешно сдали проект по диспетчеризации и уж совершенно точно я не согласен с тем, что не умею себя вести со старшими. Вот вас, Виктор Иванович, я  очень уважаю.',
    ActionBall: 4,
    ActionComment: 'Резервист применил метод расщепления аргументов. Эта спокойная взвешенная реакция может позволить в дальнейшем перевести беседу в конструктивное русло.',
    ActionNext: 4
  }, {
    ActionID: 'app1D3R4',
    ActionIdx: 4,
    ActionText: 'Виктор Иванович, я согласен с вами, что в отношениях между нашими подразделениями не всегда все проходит гладко, однако я бы не стал так уверенно утверждать, что мы не довели ни один проект до конца. В конце концов, не далее как в прошлом квартале, мы успешно сдали проект по диспетчеризации и уж совершенно точно я не согласен с тем, что не умею себя вести со старшими. Вот вас, Виктор Иванович, я  очень уважаю. Вы меня прямо расстраиваете такими обвинениями.',
    ActionBall: 5,
    ActionComment: ' ',
    ActionNext: 4
  }]
}, {
  ModuleNodeId: 'app1D4',
  ModuleNodeIndex: 3,
  ModuleNodeText: '<div class="CaseDialog1" >\n  \u0421\u0430\u043C\u0435\u0434\u043E\u0432, \u043A\u0430\u0437\u0430\u043B\u043E\u0441\u044C \u0431\u044B, \u043D\u0435\u043C\u043D\u043E\u0433\u043E \u0443\u0441\u043F\u043E\u043A\u043E\u0438\u043B\u0441\u044F \u043F\u043E\u0441\u043B\u0435 \u0432\u0430\u0448\u0438\u0445 \u0432\u0437\u0432\u0435\u0448\u0435\u043D\u043D\u044B\u0445 \u043E\u0442\u0432\u0435\u0442\u043E\u0432, \u0438 \u043D\u0435\u043C\u043D\u043E\u0433\u043E \u0432\u043E\u0440\u0447\u043B\u0438\u0432\u043E \u0437\u0430\u043C\u0435\u0442\u0438\u043B.  \n </div>\n <div class="CaseDialog2" >\n   -\t\u042F \u0441\u043B\u044B\u0448\u0430\u043B, \u0421\u0432\u044F\u0442\u043E\u0441\u043B\u0430\u0432 \u0410\u043D\u0434\u0440\u0435\u0435\u0432\u0438\u0447, \u0447\u0442\u043E \u0443 \u043D\u0430\u0441 \u043D\u0435\u0434\u0430\u0432\u043D\u043E \u0442\u0440\u0435\u043D\u0438\u043D\u0433 \u043E\u0440\u0433\u0430\u043D\u0438\u0437\u043E\u0432\u044B\u0432\u0430\u043B\u0438 \u043F\u043E \u044D\u0444\u0444\u0435\u043A\u0442\u0438\u0432\u043D\u044B\u043C \u043A\u043E\u043C\u043C\u0443\u043D\u0438\u043A\u0430\u0446\u0438\u044F\u043C, \u043A\u043E\u0440\u043E\u0447\u0435 \u043F\u043E \u0442\u043E\u043C\u0443, \u043A\u0430\u043A \u043A\u0440\u0430\u0441\u0438\u0432\u043E \u044F\u0437\u044B\u043A\u043E\u043C \u0431\u043E\u043B\u0442\u0430\u0442\u044C? \u0412\u044B, \u044F \u0441\u043C\u043E\u0442\u0440\u044E, \u0442\u043E\u0436\u0435 \u0442\u0430\u043C \u0432\u0440\u0435\u043C\u044F \u0442\u0435\u0440\u044F\u043B\u0438, \u0430 \u0442\u0435\u043F\u0435\u0440\u044C \u043D\u0430 \u043C\u043D\u0435 \u0442\u0440\u0435\u043D\u0438\u0440\u0443\u0435\u0442\u0435\u0441\u044C?\n </div>',
  ModuleNodeParams: [{
    ActionID: 'app1D4R1',
    ActionIdx: 1,
    ActionText: 'Виктор Иванович, (вы улыбаетесь и находите контакт глаз). Да, я был на этом тренинге. Но признаться откровенно те как бы «сложные» ситуации, которые мы там отрабатывали, и рядом не стояли с вашим умением взбодрить с порога. Перейдем к делу, быть может? ',
    ActionBall: 4,
    ActionComment: 'Резервист грамотно применяет техники регуляции эмоционального напряжения. Дает выпустить пар оппоненту и не поддается на провокации. В нужной мере использует комплимент.',
    ActionNext: 5
  }, {
    ActionID: 'app1D4R2',
    ActionIdx: 2,
    ActionText: 'Виктор Иванович, совершенно верно. Вам, кстати, тоже не помешало бы на этот тренинг сходить, может научились бы более конструктивно с людьми общаться.',
    ActionBall: 2,
    ActionComment: '',
    ActionNext: 1
  }, {
    ActionID: 'app1D4R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович (вы улыбаетесь и находите контакт глаз)! Да эти тренинги и близко к реальной жизни не стоят. Перейдем к делу, быть может?',
    ActionBall: 3,
    ActionComment: '',
    ActionNext: 5
  }, {
    ActionID: 'app1D4R4',
    ActionIdx: 4,
    ActionText: 'Виктор Иванович, (вы улыбаетесь и находите контакт глаз)! Да эти тренинги и близко к реальной жизни не стоят. Вот, чей бы тренинг по переговорам я, и правда, посетил, так это ваш. До сих пор помню, как вы подрядчиков разносили в 2015, а сейчас только убедился в этом. Ну, пар мы выпустили. Я искренне считаю, что без вашей экспертизы, Виктор Иванович, мы с этим, крайне важным для Компании проектом не справимся. Перейдем к делу, быть может?',
    ActionBall: 5,
    ActionComment: ' ',
    ActionNext: 5
  }]
}, {
  ModuleNodeId: 'app1D5',
  ModuleNodeIndex: 4,
  ModuleNodeText: '<div class="CaseDialog1" >\n  \u0412\u0438\u043A\u0442\u043E\u0440 \u0418\u0432\u0430\u043D\u043E\u0432\u0438\u0447 \u0432\u043F\u0435\u0440\u0432\u044B\u0435 \u0437\u0430 \u0432\u0430\u0448\u0443 \u0432\u0441\u0442\u0440\u0435\u0447\u0443 \u0441\u0434\u0435\u0440\u0436\u0430\u043D\u043D\u043E \u0443\u043B\u044B\u0431\u043D\u0443\u043B\u0441\u044F  \u0438, \u043F\u043E\u0434\u043D\u044F\u0432 \u0442\u0440\u0443\u0431\u043A\u0443, \u043F\u043E\u043F\u0440\u043E\u0441\u0438\u043B \u0441\u0435\u043A\u0440\u0435\u0442\u0430\u0440\u044F \u043F\u0440\u0438\u043D\u0435\u0441\u0442\u0438 \u0434\u0432\u0430 \u043A\u043E\u0444\u0435. \u041F\u043E\u0441\u043B\u0435 \u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u0447\u0430\u0448\u043A\u0438 \u043E\u043A\u0430\u0437\u0430\u043B\u0438\u0441\u044C \u043D\u0430 \u0441\u0442\u043E\u043B\u0435, \u043E\u043D \u0441\u0435\u043B \u043D\u0430\u043F\u0440\u043E\u0442\u0438\u0432 \u0432\u0430\u0441  \u0438, \u0432\u0441\u0435 \u0435\u0449\u0435 \u043D\u0430\u043F\u0440\u044F\u0436\u0435\u043D\u043D\u044B\u043C, \u043D\u043E \u0443\u0436\u0435 \u043E\u0442\u043A\u0440\u043E\u0432\u0435\u043D\u043D\u043E \u0431\u043E\u043B\u0435\u0435 \u043A\u043E\u043D\u0441\u0442\u0440\u0443\u043A\u0442\u0438\u0432\u043D\u044B\u043C \u0442\u043E\u043D\u043E\u043C, \u0437\u0430\u0434\u0430\u043B \u0432\u043E\u043F\u0440\u043E\u0441.   \n </div>\n <div class="CaseDialog2" >\n - \u0425\u043E\u0440\u043E\u0448\u043E, \u0421\u0432\u044F\u0442\u043E\u0441\u043B\u0430\u0432 \u0410\u043D\u0434\u0440\u0435\u0435\u0432\u0438\u0447, \u043F\u0440\u0435\u0434\u043F\u043E\u043B\u043E\u0436\u0438\u043C, \u0447\u0442\u043E \u044D\u0442\u043E\u0442 \u0432\u0430\u0448 \u043F\u0440\u043E\u0435\u043A\u0442 \u043F\u043E 3D \u043C\u043E\u0434\u0435\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044E \u0438 \u0432\u043F\u0440\u044F\u043C\u044C \u0442\u0430\u043A \u0445\u043E\u0440\u043E\u0448. \u041F\u043E\u0447\u0435\u043C\u0443 \u0432\u044B \u0441\u0447\u0438\u0442\u0430\u0435\u0442\u0435, \u0447\u0442\u043E \u044F \u0434\u043E\u043B\u0436\u0435\u043D \u043E\u0442\u0432\u043B\u0435\u043A\u0430\u0442\u044C \u0441\u0432\u043E\u0438\u0445 \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432, \u0430 \u0432\u044B \u043D\u0435 \u0445\u0443\u0436\u0435 \u043C\u0435\u043D\u044F \u0437\u043D\u0430\u0435\u0442\u0435, \u043A\u0430\u043A \u043E\u043D\u0438 \u043F\u0435\u0440\u0435\u0433\u0440\u0443\u0436\u0435\u043D\u044B, \u0438 \u043F\u043E\u043C\u043E\u0433\u0430\u0442\u044C \u0432\u0430\u043C, \u0432\u044B\u043F\u043E\u043B\u043D\u044F\u0442\u044C \u0440\u0430\u0431\u043E\u0442\u0443, \u043A\u043E\u0442\u043E\u0440\u0443\u044E, \u043F\u043E \u0441\u0443\u0442\u0438, \u043F\u043E\u0440\u0443\u0447\u0438\u043B\u0438 \u0432\u0430\u043C. \u0412\u0435\u0434\u044C \u044F \u0445\u043E\u0440\u043E\u0448\u043E \u043F\u043E\u043D\u0438\u043C\u0430\u044E, \u0447\u0442\u043E \u0432 \u0441\u043B\u0443\u0447\u0430\u0435 \u0443\u0441\u043F\u0435\u0445\u0430, \u0432\u0441\u0435 \u043B\u0430\u0432\u0440\u044B \u0434\u043E\u0441\u0442\u0430\u043D\u0443\u0442\u0441\u044F \u0432\u0430\u043C, \u0430 \u0432 \u0441\u043B\u0443\u0447\u0430\u0435 \u043D\u0435\u0443\u0434\u0430\u0447\u0438 \u043F\u043E\u043B\u0443\u0447\u0438\u043C \u043F\u043E\u0440\u043E\u0432\u043D\u0443\u2026   \n </div>',
  ModuleNodeParams: [{
    ActionID: 'app1D5R1',
    ActionIdx: 1,
    ActionText: 'Виктор Иванович, а в чем суть проблемы на ваш взгляд? Почему вы считаете этот проект не актуальным? Ведь сегодня 3D моделирование используют многие передовые компании  и весьма успешно.',
    ActionBall: 3,
    ActionComment: '',
    ActionNext: 6
  }, {
    ActionID: 'app1D5R2',
    ActionIdx: 2,
    ActionText: 'Виктор Иванович, сегодня 3D моделирование используют многие передовые компании  и весьма успешно. Я, честно говоря, хотел предложить вам  возглавить этот проект как Спонсору. Т.е. мы не будем как раньше писать ТЗ и потом ставить вас перед фактом.  Это, по сути, вы будете ставить нам задачу, какие опции и инструменты вам в первую очередь нужны. ',
    ActionBall: 5,
    ActionComment: '',
    ActionNext: 7
  }, {
    ActionID: 'app1D5R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович, вот вы сказали, что мы будем отвлекать ваших подчиненных от работы. В действительности нам будет нужна только рабочая группа для пилотного проекта, не более 4 – 5 человек, и я вам гарантирую, что не произойдет, как вы говорите ситуации, «когда все лавры достанутся мне». Предлагаю с самого начала позиционировать этот проект как совместный. Это поможет нам заработать очки для двух подразделений.',
    ActionBall: 4,
    ActionComment: '',
    ActionNext: 8
  }, {
    ActionID: 'app1D5R4',
    ActionIdx: 4,
    ActionText: 'Виктор Иванович, сдаюсь. Было всякое в наших отношениях, но с этого проекта предлагаю начать с чистого листа. Что скажете?',
    ActionBall: 2,
    ActionComment: ' ',
    ActionNext: 9
  }]
}, {
  ModuleNodeId: 'app1D6',
  ModuleNodeIndex: 5,
  ModuleNodeText: '<div class="CaseDialog1" >\n  \u0412\u0438\u043A\u0442\u043E\u0440 \u0418\u0432\u0430\u043D\u043E\u0432\u0438\u0447, \u0432\u0437\u044F\u043B \u0441\u043E \u0441\u0442\u043E\u043B\u0430 \u043B\u0438\u0441\u0442 \u0431\u0443\u043C\u0430\u0433\u0438 \u0438 \u043A\u043E\u0440\u043E\u0442\u043A\u043E \u0438\u0437\u043B\u043E\u0436\u0438\u043B \u0441\u0432\u043E\u0435 \u043C\u043D\u0435\u043D\u0438\u0435, \u0434\u0435\u043B\u0430\u044F \u043D\u0430\u0431\u0440\u043E\u0441\u043A\u0438 \u043D\u0430 \u043B\u0438\u0441\u0442\u0435 \u04104. \n </div>\n <div class="CaseDialog2" >\n - \u041F\u0440\u043E\u0431\u043B\u0435\u043C\u0430 \u0432 \u0442\u043E\u043C, \u0447\u0442\u043E \u0443 \u043D\u0430\u0441 \u043A\u043E\u043D\u0435\u0446 \u0433\u043E\u0434\u0430 \u043D\u0430 \u043D\u043E\u0441\u0443. \u0412 \u0441\u0440\u0435\u0434\u043D\u0435\u043C \u043A\u0430\u0436\u0434\u044B\u0439 \u0438\u0437 \u043C\u043E\u0438\u0445 \u043F\u043E\u0434\u0447\u0438\u043D\u0435\u043D\u043D\u044B\u0445 \u0443\u0436\u0435 \u043F\u0435\u0440\u0435\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u0442 1-2 \u0447\u0430\u0441\u0430 \u0432 \u0434\u0435\u043D\u044C. \u041E\u0441\u043D\u043E\u0432\u044B\u0432\u0430\u044F\u0441\u044C \u043D\u0430 \u043E\u043F\u044B\u0442\u0435 \u0430\u043D\u0430\u043B\u043E\u0433\u0438\u0447\u043D\u044B\u0445 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432 (\u044F \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u043B \u0430\u043D\u0430\u043B\u043E\u0433\u0438 \u0432\u0447\u0435\u0440\u0430, \u043F\u043E\u0441\u043B\u0435 \u0441\u043E\u0432\u0435\u0449\u0430\u043D\u0438\u044F, \u0433\u0434\u0435 \u0434\u0438\u0440\u0435\u043A\u0442\u043E\u0440 \u0434\u0430\u043B \u0432\u0430\u043C \u0443\u043A\u0430\u0437\u0430\u043D\u0438\u044F), \u0442\u043E\u043B\u044C\u043A\u043E \u043D\u0430 \u043F\u0435\u0440\u0432\u044B\u0439 \u044D\u0442\u0430\u043F, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043C\u044B \u0434\u043E\u043B\u0436\u043D\u044B \u043F\u0440\u043E\u0432\u0435\u0441\u0442\u0438 \u0434\u043E \u043A\u043E\u043D\u0446\u0430 \u0433\u043E\u0434\u0430 \u043F\u043E\u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F \u043E\u0442 1 500 \u0434\u043E 3 500 \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u043E-\u0447\u0430\u0441\u043E\u0432. \u0422.\u0435., \u0435\u0441\u043B\u0438 \u044F \u043E\u0442\u0432\u043B\u0435\u043A\u0443 \u0445\u043E\u0442\u044F \u0431\u044B \u043D\u0435\u0431\u043E\u043B\u044C\u0448\u0443\u044E \u0433\u0440\u0443\u043F\u043F\u0443 \u0441\u0432\u043E\u0438\u0445 \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432, \u0441 \u043E\u0434\u043D\u043E\u0439 \u0441\u0442\u043E\u0440\u043E\u043D\u044B \u043D\u0430\u0433\u0440\u0443\u0437\u043A\u0430 \u043D\u0430 \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0445 \u0432\u043E\u0437\u0440\u0430\u0441\u0442\u0435\u0442 \u043D\u0430 20-30 %, \u0430 \u0441 \u0434\u0440\u0443\u0433\u043E\u0439 \u0441\u0442\u043E\u0440\u043E\u043D\u044B, \u0443\u0447\u0438\u0442\u044B\u0432\u0430\u044F \u043D\u0435\u0431\u043E\u043B\u044C\u0448\u0443\u044E \u0447\u0438\u0441\u043B\u0435\u043D\u043D\u043E\u0441\u0442\u044C \u0432\u0430\u0448\u0435\u0433\u043E \u0414\u0435\u043F\u0430\u0440\u0442\u0430\u043C\u0435\u043D\u0442\u0430, \u0432\u044B \u0432\u0441\u0435 \u0440\u0430\u0432\u043D\u043E \u043D\u0435 \u0443\u0441\u043F\u0435\u0435\u0442\u0435 \u0434\u043E \u043A\u043E\u043D\u0446\u0430 \u0433\u043E\u0434\u0430 \u0437\u0430\u043A\u0440\u044B\u0442\u044C \u044D\u0442\u0430\u043F. \u0422\u0430\u043A \u0441\u0442\u043E\u0438\u0442 \u043B\u0438 \u0433\u043E\u0440\u043E\u0434\u0438\u0442\u044C \u043E\u0433\u043E\u0440\u043E\u0434? \u042F \u043D\u0435 \u043F\u0440\u043E\u0442\u0438\u0432 \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u043A\u0430\u043A \u0442\u0430\u043A\u043E\u0432\u043E\u0433\u043E, \u044F \u0441\u0447\u0438\u0442\u0430\u044E, \u0447\u0442\u043E \u0432 \u043A\u043E\u043D\u0446\u0435 \u0433\u043E\u0434\u0430 \u0437\u0430\u043F\u0443\u0441\u043A\u0430\u0442\u044C \u0435\u0433\u043E \u0441\u0430\u043C\u043E\u0443\u0431\u0438\u0439\u0441\u0442\u0432, \u0442\u0435\u043C \u0431\u043E\u043B\u0435\u0435 \u043D\u0430\u0433\u0440\u0443\u0436\u0430\u044F \u043C\u043E\u0438\u0445 \u043B\u044E\u0434\u0435\u0439, \u0430 \u0431\u0435\u0437 \u043D\u0430\u0441, \u0432\u044B \u043F\u0440\u0430\u0432\u044B, \u043F\u0440\u043E\u0435\u043A\u0442 \u0432\u0441\u0435 \u0440\u0430\u0432\u043D\u043E \u043D\u0435 \u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C. \n </div> ',
  ModuleNodeParams: [{
    ActionID: 'app1D6R1',
    ActionIdx: 1,
    ActionText: 'Виктор Иванович, все так, но вы забываете о нашем ИТ управлении, я уже договорился с ними и примерно 30 % работы они возьмут на себя.',
    ActionBall: 3,
    ActionComment: '',
    ActionNext: 10
  }, {
    ActionID: 'app1D6R2',
    ActionIdx: 2,
    ActionText: 'Виктор Иванович, ваши расчеты трудозатрат сложно оспорить. Однако если ввести сюда еще одну переменную, а именно наше ИТ управление, которое готово взять на себя 30 % работы, а еще 40 % трудозатрат потянут мои сотрудники, ситуация уже станет вполне контролируемой и мы с вами сможем эффективно реализовать первый этап.',
    ActionBall: 5,
    ActionComment: '',
    ActionNext: 10
  }, {
    ActionID: 'app1D6R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович, ваши расчеты трудозатрат выглядят логично. Однако вы забыли про  наше ИТ управление, которое готово взять на себя 30 % работы. Также вы не учли, что еще 40 % трудозатрат потянут мои сотрудники.  Ситуация уже станет вполне контролируемой и мы с вами сможем эффективно реализовать первый этап.',
    ActionBall: 2,
    ActionComment: '',
    ActionNext: 10
  }, {
    ActionID: 'app1D6R4',
    ActionIdx: 4,
    ActionText: 'Виктор Иванович, ваши расчеты трудозатрат сложно оспорить. Однако, если ввести сюда еще одну переменную, а именно наше ИТ управление, которое готово взять на себя 30 % работы, а еще 40 % трудозатрат потянут мои сотрудники, ситуация уже станет вполне контролируемой.',
    ActionBall: 5,
    ActionComment: ' ',
    ActionNext: 10
  }]
}, {
  ModuleNodeId: 'app1D7',
  ModuleNodeIndex: 6,
  ModuleNodeText: '<div class="CaseDialog1" >\n   \u0412\u0438\u043A\u0442\u043E\u0440 \u0418\u0432\u0430\u043D\u043E\u0432\u0438\u0447, \u044F\u0432\u043D\u043E \u043F\u043E\u043B\u044C\u0449\u0435\u043D\u043D\u044B\u0439, \u043E\u0442\u043A\u0438\u043D\u0443\u043B\u0441\u044F \u043D\u0430\u0437\u0430\u0434 \u0438 \u0432\u043D\u0438\u043C\u0430\u0442\u0435\u043B\u044C\u043D\u043E \u0440\u0430\u0441\u0441\u043C\u0430\u0442\u0440\u0438\u0432\u0430\u0435\u0442 \u0432\u0430\u0441, \u0441\u043B\u043E\u0432\u043D\u043E \u0432\u043F\u0435\u0440\u0432\u044B\u0435 \u0443\u0432\u0438\u0434\u0435\u043B. \u0417\u0430\u0442\u0435\u043C \u0443\u0441\u043C\u0435\u0445\u043D\u0443\u043B\u0441\u044F \u0438 \u0434\u043E\u0431\u0440\u043E\u0434\u0443\u0448\u043D\u043E \u043F\u0440\u043E\u0438\u0437\u043D\u0435\u0441. \n </div>\n <div class="CaseDialog2" >\n -  \u042D\u0442\u043E \u0447\u0442\u043E, \u0421\u0432\u044F\u0442\u043E\u0441\u043B\u0430\u0432, \u0442\u0430\u043A\u0430\u044F \u0444\u043E\u0440\u043C\u0430 \u0432\u0437\u044F\u0442\u043A\u0438 \u0437\u0430 \u043C\u043E\u044E \u043F\u043E\u043C\u043E\u0449\u044C?  \n </div> ',
  ModuleNodeParams: [{
    ActionID: 'app1D7R1',
    ActionIdx: 1,
    ActionText: 'От вас ничего не утаить, Виктор Иванович, если хотите, называйте это так. Главное, чтобы дело было сделано, для эффективности нашей организации. ',
    ActionBall: 3,
    ActionComment: '',
    ActionNext: 10
  }, {
    ActionID: 'app1D7R2',
    ActionIdx: 2,
    ActionText: 'А вы как сами думаете?',
    ActionBall: 2,
    ActionComment: '',
    ActionNext: 10
  }, {
    ActionID: 'app1D7R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович, да как можно! Все в курсе вашей щепетильности. Я думал, что мы уже бросили в игры играть и обсуждаем проект по-деловому без подначек. Я не прав? ',
    ActionBall: 4,
    ActionComment: '',
    ActionNext: 10
  }, {
    ActionID: 'app1D7R4',
    ActionIdx: 4,
    ActionText: 'Виктор Иванович, если честно, я долго размышлял и пришел к выводу, что этот проект без вас просто изначально мертворожденный. Поэтому это никакая не лесть, это факт, и я надеюсь, что дальше у нас все пойдет исключительно по-деловому.',
    ActionBall: 5,
    ActionComment: ' ',
    ActionNext: 10
  }]
}, {
  ModuleNodeId: 'app1D8',
  ModuleNodeIndex: 7,
  ModuleNodeText: '<div class="CaseDialog1" >\n  \u0412\u0438\u043A\u0442\u043E\u0440 \u0418\u0432\u0430\u043D\u043E\u0432\u0438\u0447, \u0432\u0437\u044F\u043B \u0441\u043E \u0441\u0442\u043E\u043B\u0430 \u043B\u0438\u0441\u0442 \u0431\u0443\u043C\u0430\u0433\u0438 \u0438 \u043A\u043E\u0440\u043E\u0442\u043A\u043E \u0438\u0437\u043B\u043E\u0436\u0438\u043B \u0441\u0432\u043E\u0435 \u043C\u043D\u0435\u043D\u0438\u0435, \u0434\u0435\u043B\u0430\u044F \u043D\u0430\u0431\u0440\u043E\u0441\u043A\u0438 \u043D\u0430 \u043B\u0438\u0441\u0442\u0435 \u04104. \n </div>\n <div class="CaseDialog2" >\n - \u041F\u0440\u043E\u0431\u043B\u0435\u043C\u0430 \u0432 \u0442\u043E\u043C, \u0447\u0442\u043E \u0443 \u043D\u0430\u0441 \u043A\u043E\u043D\u0435\u0446 \u0433\u043E\u0434\u0430 \u043D\u0430 \u043D\u043E\u0441\u0443. \u0412 \u0441\u0440\u0435\u0434\u043D\u0435\u043C \u043A\u0430\u0436\u0434\u044B\u0439 \u0438\u0437 \u043C\u043E\u0438\u0445 \u043F\u043E\u0434\u0447\u0438\u043D\u0435\u043D\u043D\u044B\u0445 \u0443\u0436\u0435 \u043F\u0435\u0440\u0435\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u0442 1-2 \u0447\u0430\u0441\u0430 \u0432 \u0434\u0435\u043D\u044C. \u041E\u0441\u043D\u043E\u0432\u044B\u0432\u0430\u044F\u0441\u044C \u043D\u0430 \u043E\u043F\u044B\u0442\u0435 \u0430\u043D\u0430\u043B\u043E\u0433\u0438\u0447\u043D\u044B\u0445 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432 (\u044F \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u043B \u0430\u043D\u0430\u043B\u043E\u0433\u0438 \u0432\u0447\u0435\u0440\u0430, \u043F\u043E\u0441\u043B\u0435 \u0441\u043E\u0432\u0435\u0449\u0430\u043D\u0438\u044F, \u0433\u0434\u0435 \u0434\u0438\u0440\u0435\u043A\u0442\u043E\u0440 \u0434\u0430\u043B \u0432\u0430\u043C \u0443\u043A\u0430\u0437\u0430\u043D\u0438\u044F), \u0442\u043E\u043B\u044C\u043A\u043E \u043D\u0430 \u043F\u0435\u0440\u0432\u044B\u0439 \u044D\u0442\u0430\u043F, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043C\u044B \u0434\u043E\u043B\u0436\u043D\u044B \u043F\u0440\u043E\u0432\u0435\u0441\u0442\u0438 \u0434\u043E \u043A\u043E\u043D\u0446\u0430 \u0433\u043E\u0434\u0430 \u043F\u043E\u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F \u043E\u0442 1 500 \u0434\u043E 3 500 \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u043E-\u0447\u0430\u0441\u043E\u0432. \u0422.\u0435., \u0435\u0441\u043B\u0438 \u044F \u043E\u0442\u0432\u043B\u0435\u043A\u0443 \u0445\u043E\u0442\u044F \u0431\u044B \u043D\u0435\u0431\u043E\u043B\u044C\u0448\u0443\u044E \u0433\u0440\u0443\u043F\u043F\u0443 \u0441\u0432\u043E\u0438\u0445 \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432, \u0441 \u043E\u0434\u043D\u043E\u0439 \u0441\u0442\u043E\u0440\u043E\u043D\u044B \u043D\u0430\u0433\u0440\u0443\u0437\u043A\u0430 \u043D\u0430 \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0445 \u0432\u043E\u0437\u0440\u0430\u0441\u0442\u0435\u0442 \u043D\u0430 20-30 %, \u0430 \u0441 \u0434\u0440\u0443\u0433\u043E\u0439 \u0441\u0442\u043E\u0440\u043E\u043D\u044B, \u0443\u0447\u0438\u0442\u044B\u0432\u0430\u044F \u043D\u0435\u0431\u043E\u043B\u044C\u0448\u0443\u044E \u0447\u0438\u0441\u043B\u0435\u043D\u043D\u043E\u0441\u0442\u044C \u0432\u0430\u0448\u0435\u0433\u043E \u0414\u0435\u043F\u0430\u0440\u0442\u0430\u043C\u0435\u043D\u0442\u0430, \u0432\u044B \u0432\u0441\u0435 \u0440\u0430\u0432\u043D\u043E \u043D\u0435 \u0443\u0441\u043F\u0435\u0435\u0442\u0435 \u0434\u043E \u043A\u043E\u043D\u0446\u0430 \u0433\u043E\u0434\u0430 \u0437\u0430\u043A\u0440\u044B\u0442\u044C \u044D\u0442\u0430\u043F. \u0422\u0430\u043A \u0441\u0442\u043E\u0438\u0442 \u043B\u0438 \u0433\u043E\u0440\u043E\u0434\u0438\u0442\u044C \u043E\u0433\u043E\u0440\u043E\u0434? \u042F \u043D\u0435 \u043F\u0440\u043E\u0442\u0438\u0432 \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u043A\u0430\u043A \u0442\u0430\u043A\u043E\u0432\u043E\u0433\u043E, \u044F \u0441\u0447\u0438\u0442\u0430\u044E, \u0447\u0442\u043E \u0432 \u043A\u043E\u043D\u0446\u0435 \u0433\u043E\u0434\u0430 \u0437\u0430\u043F\u0443\u0441\u043A\u0430\u0442\u044C \u0435\u0433\u043E \u0441\u0430\u043C\u043E\u0443\u0431\u0438\u0439\u0441\u0442\u0432, \u0442\u0435\u043C \u0431\u043E\u043B\u0435\u0435 \u043D\u0430\u0433\u0440\u0443\u0436\u0430\u044F \u043C\u043E\u0438\u0445 \u043B\u044E\u0434\u0435\u0439, \u0430 \u0431\u0435\u0437 \u043D\u0430\u0441, \u0432\u044B \u043F\u0440\u0430\u0432\u044B, \u043F\u0440\u043E\u0435\u043A\u0442 \u0432\u0441\u0435 \u0440\u0430\u0432\u043D\u043E \u043D\u0435 \u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C. \n </div> ',
  ModuleNodeParams: [{
    ActionID: 'app1D8R1',
    ActionIdx: 1,
    ActionText: 'Виктор Иванович, все так, но вы забываете о нашем ИТ управлении, я уже договорился с ними и примерно 30 % работы они возьмут на себя.',
    ActionBall: 3,
    ActionComment: '',
    ActionNext: 10
  }, {
    ActionID: 'app1D8R2',
    ActionIdx: 2,
    ActionText: 'Виктор Иванович, ваши расчеты трудозатрат сложно оспорить. Однако если ввести сюда еще одну переменную, а именно наше ИТ управление, которое готово взять на себя 30 % работы, а еще 40 % трудозатрат потянут мои сотрудники, ситуация уже станет вполне контролируемой и мы с вами сможем эффективно реализовать первый этап.',
    ActionBall: 5,
    ActionComment: '',
    ActionNext: 10
  }, {
    ActionID: 'app1D8R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович, ваши расчеты трудозатрат выглядят логично. Однако вы забыли про  наше ИТ управление, которое готово взять на себя 30 % работы. Также вы не учли, что еще 40 % трудозатрат потянут мои сотрудники.  Ситуация уже станет вполне контролируемой и мы с вами сможем эффективно реализовать первый этап.',
    ActionBall: 2,
    ActionComment: '',
    ActionNext: 10
  }]
}, {
  ModuleNodeId: 'app1D9',
  ModuleNodeIndex: 8,
  ModuleNodeText: '<div class="CaseDialog1" >\n  \u0412\u0438\u043A\u0442\u043E\u0440 \u0418\u0432\u0430\u043D\u043E\u0432\u0438\u0447, \u0432\u0437\u044F\u043B \u0441\u043E \u0441\u0442\u043E\u043B\u0430 \u043B\u0438\u0441\u0442 \u0431\u0443\u043C\u0430\u0433\u0438 \u0438 \u043A\u043E\u0440\u043E\u0442\u043A\u043E \u0438\u0437\u043B\u043E\u0436\u0438\u043B \u0441\u0432\u043E\u0435 \u043C\u043D\u0435\u043D\u0438\u0435, \u0434\u0435\u043B\u0430\u044F \u043D\u0430\u0431\u0440\u043E\u0441\u043A\u0438 \u043D\u0430 \u043B\u0438\u0441\u0442\u0435 \u04104. \n </div>\n <div class="CaseDialog2" >\n - \u041F\u0440\u043E\u0431\u043B\u0435\u043C\u0430 \u0432 \u0442\u043E\u043C, \u0447\u0442\u043E \u0443 \u043D\u0430\u0441 \u043A\u043E\u043D\u0435\u0446 \u0433\u043E\u0434\u0430 \u043D\u0430 \u043D\u043E\u0441\u0443. \u0412 \u0441\u0440\u0435\u0434\u043D\u0435\u043C \u043A\u0430\u0436\u0434\u044B\u0439 \u0438\u0437 \u043C\u043E\u0438\u0445 \u043F\u043E\u0434\u0447\u0438\u043D\u0435\u043D\u043D\u044B\u0445 \u0443\u0436\u0435 \u043F\u0435\u0440\u0435\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u0442 1-2 \u0447\u0430\u0441\u0430 \u0432 \u0434\u0435\u043D\u044C. \u041E\u0441\u043D\u043E\u0432\u044B\u0432\u0430\u044F\u0441\u044C \u043D\u0430 \u043E\u043F\u044B\u0442\u0435 \u0430\u043D\u0430\u043B\u043E\u0433\u0438\u0447\u043D\u044B\u0445 \u043F\u0440\u043E\u0435\u043A\u0442\u043E\u0432 (\u044F \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0435\u043B \u0430\u043D\u0430\u043B\u043E\u0433\u0438 \u0432\u0447\u0435\u0440\u0430, \u043F\u043E\u0441\u043B\u0435 \u0441\u043E\u0432\u0435\u0449\u0430\u043D\u0438\u044F, \u0433\u0434\u0435 \u0434\u0438\u0440\u0435\u043A\u0442\u043E\u0440 \u0434\u0430\u043B \u0432\u0430\u043C \u0443\u043A\u0430\u0437\u0430\u043D\u0438\u044F), \u0442\u043E\u043B\u044C\u043A\u043E \u043D\u0430 \u043F\u0435\u0440\u0432\u044B\u0439 \u044D\u0442\u0430\u043F, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u043C\u044B \u0434\u043E\u043B\u0436\u043D\u044B \u043F\u0440\u043E\u0432\u0435\u0441\u0442\u0438 \u0434\u043E \u043A\u043E\u043D\u0446\u0430 \u0433\u043E\u0434\u0430 \u043F\u043E\u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044F \u043E\u0442 1 500 \u0434\u043E 3 500 \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u043E-\u0447\u0430\u0441\u043E\u0432. \u0422.\u0435., \u0435\u0441\u043B\u0438 \u044F \u043E\u0442\u0432\u043B\u0435\u043A\u0443 \u0445\u043E\u0442\u044F \u0431\u044B \u043D\u0435\u0431\u043E\u043B\u044C\u0448\u0443\u044E \u0433\u0440\u0443\u043F\u043F\u0443 \u0441\u0432\u043E\u0438\u0445 \u0441\u043E\u0442\u0440\u0443\u0434\u043D\u0438\u043A\u043E\u0432, \u0441 \u043E\u0434\u043D\u043E\u0439 \u0441\u0442\u043E\u0440\u043E\u043D\u044B \u043D\u0430\u0433\u0440\u0443\u0437\u043A\u0430 \u043D\u0430 \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0445 \u0432\u043E\u0437\u0440\u0430\u0441\u0442\u0435\u0442 \u043D\u0430 20-30 %, \u0430 \u0441 \u0434\u0440\u0443\u0433\u043E\u0439 \u0441\u0442\u043E\u0440\u043E\u043D\u044B, \u0443\u0447\u0438\u0442\u044B\u0432\u0430\u044F \u043D\u0435\u0431\u043E\u043B\u044C\u0448\u0443\u044E \u0447\u0438\u0441\u043B\u0435\u043D\u043D\u043E\u0441\u0442\u044C \u0432\u0430\u0448\u0435\u0433\u043E \u0414\u0435\u043F\u0430\u0440\u0442\u0430\u043C\u0435\u043D\u0442\u0430, \u0432\u044B \u0432\u0441\u0435 \u0440\u0430\u0432\u043D\u043E \u043D\u0435 \u0443\u0441\u043F\u0435\u0435\u0442\u0435 \u0434\u043E \u043A\u043E\u043D\u0446\u0430 \u0433\u043E\u0434\u0430 \u0437\u0430\u043A\u0440\u044B\u0442\u044C \u044D\u0442\u0430\u043F. \u0422\u0430\u043A \u0441\u0442\u043E\u0438\u0442 \u043B\u0438 \u0433\u043E\u0440\u043E\u0434\u0438\u0442\u044C \u043E\u0433\u043E\u0440\u043E\u0434? \u042F \u043D\u0435 \u043F\u0440\u043E\u0442\u0438\u0432 \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u043A\u0430\u043A \u0442\u0430\u043A\u043E\u0432\u043E\u0433\u043E, \u044F \u0441\u0447\u0438\u0442\u0430\u044E, \u0447\u0442\u043E \u0432 \u043A\u043E\u043D\u0446\u0435 \u0433\u043E\u0434\u0430 \u0437\u0430\u043F\u0443\u0441\u043A\u0430\u0442\u044C \u0435\u0433\u043E \u0441\u0430\u043C\u043E\u0443\u0431\u0438\u0439\u0441\u0442\u0432, \u0442\u0435\u043C \u0431\u043E\u043B\u0435\u0435 \u043D\u0430\u0433\u0440\u0443\u0436\u0430\u044F \u043C\u043E\u0438\u0445 \u043B\u044E\u0434\u0435\u0439, \u0430 \u0431\u0435\u0437 \u043D\u0430\u0441, \u0432\u044B \u043F\u0440\u0430\u0432\u044B, \u043F\u0440\u043E\u0435\u043A\u0442 \u0432\u0441\u0435 \u0440\u0430\u0432\u043D\u043E \u043D\u0435 \u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C. \n </div> ',
  ModuleNodeParams: [{
    ActionID: 'app1D9R1',
    ActionIdx: 1,
    ActionText: 'Виктор Иванович, все так, но вы забываете о нашем ИТ управлении, я уже договорился с ними и примерно 30 % работы они возьмут на себя.',
    ActionBall: 3,
    ActionComment: '',
    ActionNext: 10
  }, {
    ActionID: 'app1D9R2',
    ActionIdx: 2,
    ActionText: 'Виктор Иванович, ваши расчеты трудозатрат сложно оспорить. Однако если ввести сюда еще одну переменную, а именно наше ИТ управление, которое готово взять на себя 30 % работы, а еще 40 % трудозатрат потянут мои сотрудники, ситуация уже станет вполне контролируемой и мы с вами сможем эффективно реализовать первый этап.',
    ActionBall: 5,
    ActionComment: '',
    ActionNext: 10
  }, {
    ActionID: 'app1D9R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович, ваши расчеты трудозатрат выглядят логично. Однако вы забыли про  наше ИТ управление, которое готово взять на себя 30 % работы. Также вы не учли, что еще 40 % трудозатрат потянут мои сотрудники.  Ситуация уже станет вполне контролируемой и мы с вами сможем эффективно реализовать первый этап.',
    ActionBall: 2,
    ActionComment: '',
    ActionNext: 10
  }]
}, {
  ModuleNodeId: 'app1D10',
  ModuleNodeIndex: 9,
  ModuleNodeText: '<div class="CaseDialog1" >\n  \u0412\u0438\u043A\u0442\u043E\u0440 \u0418\u0432\u0430\u043D\u043E\u0432\u0438\u0447, \u043F\u0440\u0438\u0433\u043B\u0430\u0448\u0430\u0435\u0442 \u0432\u0430\u0441 \u043F\u0438\u0442\u044C \u043A\u043E\u0444\u0435, \u0430 \u0441\u0430\u043C \u043F\u043E\u043F\u0440\u043E\u0441\u0438\u043B \u043F\u044F\u0442\u044C \u043C\u0438\u043D\u0443\u0442 \u043D\u0430 \u0440\u0430\u0437\u043C\u044B\u0448\u043B\u0435\u043D\u0438\u0435, \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E \u0447\u0442\u043E-\u0442\u043E, \u0440\u0438\u0441\u0443\u044F \u0443 \u0441\u0435\u0431\u044F \u0432 \u0431\u043B\u043E\u043A\u043D\u043E\u0442\u0435. \u041D\u0430\u043A\u043E\u043D\u0435\u0446, \u043E\u043D \u043F\u043E\u0434\u043D\u044F\u043B \u0433\u043E\u043B\u043E\u0432\u0443 \u0438 \u0432\u044B\u0434\u0432\u0438\u043D\u0443\u043B \u0441\u043B\u0435\u0434\u0443\u044E\u0449\u0438\u0435 \u043F\u0440\u0435\u0434\u043B\u043E\u0436\u0435\u043D\u0438\u044F \u0438 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u044B: \n </div>\n <div class="CaseDialog2" >\n - \u0425\u043E\u0440\u043E\u0448\u043E. \u0414\u0430\u0432\u0430\u0439\u0442\u0435 \u0442\u0430\u043A. \u042F \u0441\u043E\u0433\u043B\u0430\u0441\u0435\u043D \u0432\u044B\u0434\u0435\u043B\u0438\u0442\u044C 5 \u0447\u0435\u043B\u043E\u0432\u0435\u043A \u0432 \u043A\u043E\u043C\u0430\u043D\u0434\u0443 \u0434\u043E \u043A\u043E\u043D\u0446\u0430 \u0433\u043E\u0434\u0430. \u0411\u043E\u043B\u044C\u0448\u0435 \u043D\u0435 \u043C\u043E\u0433\u0443 \u043D\u0438\u043A\u0430\u043A. \u041F\u043E\u0442\u043E\u043C \u043F\u043E\u0441\u043C\u043E\u0442\u0440\u0438\u0448\u044C. \u041F\u043E\u043D\u044F\u0442\u043D\u043E, \u0447\u0442\u043E \u044F \u0432\u044B\u0434\u0435\u043B\u044E \u0441\u0430\u043C\u044B\u0445 \u043B\u0443\u0447\u0448\u0438\u0445, \u043F\u043E\u044D\u0442\u043E\u043C\u0443 \u043D\u0430 \u0438\u0445 \u0440\u0430\u0431\u043E\u0442\u0443 \u043C\u044B \u0432\u043E\u0437\u044C\u043C\u0435\u043C \u043F\u0440\u0438\u043C\u0435\u0440\u043D\u043E 40 % \u043E\u0442 \u0431\u044E\u0434\u0436\u0435\u0442\u0430 \u043F\u0440\u043E\u0435\u043A\u0442\u0430, \u044F \u0441\u043B\u044B\u0448\u0430\u043B \u043E\u043D \u0443 \u0432\u0430\u0441 10 \u043C\u043B\u043D. \u0440\u0443\u0431\u043B\u0435\u0439.  \u0414\u0443\u043C\u0430\u044E, \u0447\u0442\u043E \u044D\u0442\u043E \u0440\u0430\u0437\u0443\u043C\u043D\u043E. \u0414\u0430\u043B\u044C\u0448\u0435, \u043F\u043E\u0441\u043B\u0435 \u0442\u043E\u0433\u043E, \u043A\u0430\u043A \u043C\u044B \u0441\u043E\u0433\u043B\u0430\u0441\u0443\u0435\u043C \u0422\u0417, \u044F \u0445\u043E\u0447\u0443, \u0447\u0442\u043E\u0431\u044B \u0432\u0441\u0435 \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u044F \u0441\u043E\u0433\u043B\u0430\u0441\u043E\u0432\u044B\u0432\u0430\u043B\u0438\u0441\u044C \u043B\u0438\u0447\u043D\u043E \u0441\u043E \u043C\u043D\u043E\u0439, \u0430 \u043D\u0435 \u0442\u0430\u043A, \u043A\u0430\u043A \u044D\u0442\u043E \u043E\u0431\u044B\u0447\u043D\u043E \u0443 \u0432\u0430\u0441 \u0431\u044B\u0432\u0430\u0435\u0442, \u043A\u043E\u0433\u0434\u0430 \u043F\u043E \u0445\u043E\u0434\u0443 \u043F\u0440\u043E\u0435\u043A\u0442 \u0438\u0437\u043C\u0435\u043D\u044F\u0435\u0442\u0441\u044F \u0434\u043E \u043D\u0435\u0443\u0437\u043D\u0430\u0432\u0430\u0435\u043C\u043E\u0441\u0442\u0438. \n </div>  ',
  ModuleNodeParams: [{
    ActionID: 'app1D10R1',
    ActionIdx: 1,
    ActionText: 'Виктор Иванович, вам палец протяни, вы руку оттяпаете, не выдерживаете вы. Поумерьте аппетит!',
    ActionBall: 2,
    ActionComment: '',
    ActionNext: 1
  }, {
    ActionID: 'app1D10R2',
    ActionIdx: 2,
    ActionText: 'Виктор Иванович, да проект составляет 10 миллионов. Однако половина этих денег предназначена для оборудования. Поэтому, к сожалению, о 40 % от бюджета проекта говорить тяжело. Кроме того, согласно плана, на долю ваших сотрудников, которых, кстати, нам понадобиться не 5, а 7 человек приходится только 30 % трудозатрат, поэтому я считаю логичным и корректным, согласовать им выделение именно такого бюджета. Что касается согласования изменений и вашей роли, я предлагаю обсудить это после того, как мы договоримся по первым двум вопросам.',
    ActionBall: 4,
    ActionComment: '',
    ActionNext: 11
  }, {
    ActionID: 'app1D10R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович, так не пойдет.  Проект составляет 10 миллионов, и половина этих денег предназначена для оборудования. Поэтому, к сожалению, о 40 % от бюджета проекта говорить невозможно. Согласно плана, на долю ваших сотрудников приходится только 30 % трудозатрат, поэтому я считаю логичным и корректным согласовать им выделение именно такого бюджета.  И, кстати, давайте выделим 7 человек. Пять, как вы сами понимаете, никак не справятся. Что касается согласования изменений и вашей роли, я предлагаю обсудить это после того, как мы договоримся по первым двум вопросам. ',
    ActionBall: 3,
    ActionComment: '',
    ActionNext: 11
  }, {
    ActionID: 'app1D10R4',
    ActionIdx: 4,
    ActionText: 'Виктор Иванович, да проект составляет 10 миллионов. Однако половина этих денег предназначена для оборудования. Поэтому, к сожалению, о 40 % от бюджета проекта говорить тяжело. Кроме того, согласно плана, на долю ваших сотрудников, которых, кстати, нам понадобиться не 5, а 7 человек приходится только 30 % трудозатрат, поэтому я считаю логичным и корректным согласовать им выделение именно такого бюджета. Что касается согласования изменений и вашей роли, я только  за ваше активное участие, предлагаю обсудить это после того, как мы договоримся по первым двум вопросам.',
    ActionBall: 5,
    ActionComment: ' ',
    ActionNext: 11
  }]
}, {
  ModuleNodeId: 'app1D11',
  ModuleNodeIndex: 10,
  ModuleNodeText: '  <div class="CaseDialog1" >\n  \u041D\u0438\u0436\u0435 \u043F\u0440\u0438\u0432\u0435\u0434\u0435\u043D\u044B \u0447\u0435\u0442\u044B\u0440\u0435 \u0432\u0430\u0440\u0438\u0430\u043D\u0442\u0430 \u0444\u0438\u043D\u0430\u043B\u044C\u043D\u044B\u0445 \u0434\u043E\u0433\u043E\u0432\u043E\u0440\u0435\u043D\u043D\u043E\u0441\u0442\u0435\u0439, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043C\u043E\u0433\u043B\u0438 \u0431\u044B \u0431\u044B\u0442\u044C \u0434\u043E\u0441\u0442\u0438\u0433\u043D\u0443\u0442\u044B \u0432 \u0445\u043E\u0434\u0435 \u0434\u0430\u043D\u043D\u043E\u0439 \u0441\u0438\u0442\u0443\u0430\u0446\u0438\u0438. \u0412\u0430\u043C \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0432\u044B\u0431\u0440\u0430\u0442\u044C \u043E\u043F\u0442\u0438\u043C\u0430\u043B\u044C\u043D\u044B\u0439, \u043D\u0430 \u0432\u0430\u0448 \u0432\u0437\u0433\u043B\u044F\u0434, \u0430 \u0437\u0430\u0442\u0435\u043C \u0432\u044B\u0431\u0440\u0430\u0442\u044C \u043D\u0430\u0438\u0431\u043E\u043B\u0435\u0435 \u0441\u0438\u043B\u044C\u043D\u044B\u0435 \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u044B \u0432 \u0435\u0433\u043E \u043F\u043E\u043B\u044C\u0437\u0443.  \n </div>',
  ModuleNodeParams: [{
    ActionID: 'app1D11R1',
    ActionIdx: 1,
    ActionText: '\u2022\t\u0418.\u0412. \u0421\u0430\u043C\u0435\u0434\u043E\u0432 \u0432\u044B\u0434\u0435\u043B\u044F\u0435\u0442 5 \u0447\u0435\u043B\u043E\u0432\u0435\u043A \u0432 \u043F\u0440\u043E\u0435\u043A\u0442. \n    \u2022\t\u0418\u043C \u0432\u044B\u0434\u0435\u043B\u044F\u0435\u0442\u0441\u044F 30 % \u043E\u0442 \u0431\u044E\u0434\u0436\u0435\u0442\u0430 \u0432 10 \u043C\u043B\u043D. \u0440\u0443\u0431.\n    \u2022\t\u0412\u044B \u0433\u043B\u0430\u0432\u043D\u044B\u0439 \u043C\u0435\u043D\u0435\u0434\u0436\u0435\u0440 \u043F\u0440\u043E\u0435\u043A\u0442\u0430, \u043D\u043E \u043F\u043E \u0432\u043E\u043F\u0440\u043E\u0441\u0430\u043C \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u044F \u0443\u0441\u043B\u043E\u0432\u0438\u0439 \u0422\u0417 \u043E\u0431\u044F\u0437\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u0435 \u0441\u043E\u0433\u043B\u0430\u0441\u043E\u0432\u0430\u043D\u0438\u0435 \u0441  \u0421\u0430\u043C\u0435\u0434\u043E\u0432\u044B\u043C. ',
    ActionBall: 2,
    ActionComment: '',
    ActionNext: 1
  }, {
    ActionID: 'app1D11R2',
    ActionIdx: 2,
    ActionText: '\u2022\t\u0418.\u0412. \u0421\u0430\u043C\u0435\u0434\u043E\u0432 \u0432\u044B\u0434\u0435\u043B\u044F\u0435\u0442 4 \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430 \u0432 \u043F\u0440\u043E\u0435\u043A\u0442. \n    \u2022\t\u0418\u043C \u0432\u044B\u0434\u0435\u043B\u044F\u0435\u0442\u0441\u044F 30 % \u043E\u0442 \u0431\u044E\u0434\u0436\u0435\u0442\u0430 \u0432 5 \u043C\u043B\u043D. \u0440\u0443\u0431.\n    \u2022\t\u0412\u044B \u0433\u043B\u0430\u0432\u043D\u044B\u0439 \u043C\u0435\u043D\u0435\u0434\u0436\u0435\u0440 \u043F\u0440\u043E\u0435\u043A\u0442\u0430, \u043D\u043E \u043F\u043E \u0432\u043E\u043F\u0440\u043E\u0441\u0430\u043C \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u044F \u0443\u0441\u043B\u043E\u0432\u0438\u0439 \u0422\u0417 \u043E\u0431\u044F\u0437\u0430\u0442\u0435\u043B\u044C\u043D\u043E\u0435 \u0441\u043E\u0433\u043B\u0430\u0441\u043E\u0432\u0430\u043D\u0438\u0435 \u0441  \u0421\u0430\u043C\u0435\u0434\u043E\u0432\u044B\u043C.',
    ActionBall: 4,
    ActionComment: '',
    ActionNext: 12
  }, {
    ActionID: 'app1D11R3',
    ActionIdx: 3,
    ActionText: '\u2022\t\u0418.\u0412. \u0421\u0430\u043C\u0435\u0434\u043E\u0432 \u0432\u044B\u0434\u0435\u043B\u044F\u0435\u0442 7 \u0447\u0435\u043B\u043E\u0432\u0435\u043A \u0432 \u043F\u0440\u043E\u0435\u043A\u0442. \n    \u2022\t\u0418\u043C \u0432\u044B\u0434\u0435\u043B\u044F\u0435\u0442\u0441\u044F 30 % \u043E\u0442 \u0431\u044E\u0434\u0436\u0435\u0442\u0430 \u0432 5 \u043C\u043B\u043D. \u0440\u0443\u0431.\n    \u2022\t\u0412\u044B \u0433\u043B\u0430\u0432\u043D\u044B\u0439 \u043C\u0435\u043D\u0435\u0434\u0436\u0435\u0440 \u043F\u0440\u043E\u0435\u043A\u0442\u0430, \u0441 \u043F\u0440\u0430\u0432\u043E\u043C \u0440\u0435\u0448\u0430\u044E\u0449\u0435\u0433\u043E \u0433\u043E\u043B\u043E\u0441\u0430. \u041E\u0431 \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u0438 \u0422\u0417 \u0441\u0442\u0440\u0443\u043A\u0442\u0443\u0440\u044B \u0418.\u0412. \u0421\u0430\u043C\u0435\u0434\u043E\u0432\u0430 \u0438\u043D\u0444\u043E\u0440\u043C\u0438\u0440\u0443\u044E\u0442\u0441\u044F \u043D\u0435\u0437\u0430\u043C\u0435\u0434\u043B\u0438\u0442\u0435\u043B\u044C\u043D\u043E.',
    ActionBall: 5,
    ActionComment: '',
    ActionNext: 13
  }, {
    ActionID: 'app1D11R4',
    ActionIdx: 4,
    ActionText: '\u2022\t\u0418.\u0412. \u0421\u0430\u043C\u0435\u0434\u043E\u0432 \u0432\u044B\u0434\u0435\u043B\u044F\u0435\u0442 10 \u0447\u0435\u043B\u043E\u0432\u0435\u043A \u0432 \u043F\u0440\u043E\u0435\u043A\u0442. \n    \u2022\t\u0418\u043C \u0432\u044B\u0434\u0435\u043B\u044F\u0435\u0442\u0441\u044F 10 % \u043E\u0442 \u0431\u044E\u0434\u0436\u0435\u0442\u0430 \u0432 5 \u043C\u043B\u043D. \u0440\u0443\u0431.\n    \u2022\t\u0412\u044B \u0433\u043B\u0430\u0432\u043D\u044B\u0439 \u043C\u0435\u043D\u0435\u0434\u0436\u0435\u0440 \u043F\u0440\u043E\u0435\u043A\u0442\u0430 \u0441 \u043F\u0440\u0430\u0432\u043E\u043C \u0440\u0435\u0448\u0430\u044E\u0449\u0435\u0433\u043E \u0433\u043E\u043B\u043E\u0441\u0430.',
    ActionBall: 3,
    ActionComment: ' ',
    ActionNext: 14
  }]
}, {
  ModuleNodeId: 'app1D12',
  ModuleNodeIndex: 11,
  ModuleNodeText: '  <div class="CaseDialog1" > \u0423 \u0432\u0430\u0441 \u0447\u0435\u0442\u044B\u0440\u0435 \u0432\u0430\u0440\u0438\u0430\u043D\u0442\u044B \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u0438 \u0441\u0432\u043E\u0435\u0439 \u043F\u043E\u0437\u0438\u0446\u0438\u0438, \u0447\u0442\u043E \u0432\u044B \u0432\u044B\u0431\u0435\u0440\u0435\u0442\u0435? </div> ',
  ModuleNodeParams: [{
    ActionID: 'app1D12R1',
    ActionIdx: 1,
    ActionText: 'Я считаю, что здесь и обсуждать нечего этот вариант самый лучший! Виктор Иванович, соглашайтесь! ',
    ActionBall: 3,
    ActionComment: '',
    ActionNext: 15
  }, {
    ActionID: 'app1D12R2',
    ActionIdx: 2,
    ActionText: 'Виктор Иванович, мы с вами потратили 2 часа своего времени на сложные переговоры и договорились почти до всего. Это последние уступки, на которые я могу пойти. Принимайте решение или расходимся!',
    ActionBall: 2,
    ActionComment: '',
    ActionNext: 15
  }, {
    ActionID: 'app1D12R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович, наш проект очень важен для компании и нам необходимо договориться. Мы с вами продуктивно поработали два часа и выработали массу различных вариантов финальных договоренностей. Очевидно, что текущие оптимальны (перечисление), предлагаю принять их и начать работать. ',
    ActionBall: 5,
    ActionComment: '',
    ActionNext: 15
  }, {
    ActionID: 'app1D12R4',
    ActionIdx: 4,
    ActionText: 'Виктор Иванович, наш проект очень важен для компании, и нам необходимо договориться. Иначе нас может заставлять договориться директор, а вы понимаете, чем это закончится. ',
    ActionBall: 4,
    ActionComment: ' ',
    ActionNext: 15
  }]
}, {
  ModuleNodeId: 'app1D13',
  ModuleNodeIndex: 12,
  ModuleNodeText: '  <div class="CaseDialog1" > \u0423 \u0432\u0430\u0441 \u0447\u0435\u0442\u044B\u0440\u0435 \u0432\u0430\u0440\u0438\u0430\u043D\u0442\u044B \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u0438 \u0441\u0432\u043E\u0435\u0439 \u043F\u043E\u0437\u0438\u0446\u0438\u0438, \u0447\u0442\u043E \u0432\u044B \u0432\u044B\u0431\u0435\u0440\u0435\u0442\u0435? </div> ',
  ModuleNodeParams: [{
    ActionID: 'app1D13R1',
    ActionIdx: 1,
    ActionText: 'Я считаю, что здесь и обсуждать нечего этот вариант самый лучший! Виктор Иванович, соглашайтесь! ',
    ActionBall: 3,
    ActionComment: '',
    ActionNext: 15
  }, {
    ActionID: 'app1D13R2',
    ActionIdx: 2,
    ActionText: 'Виктор Иванович, мы с вами потратили 2 часа своего времени на сложные переговоры и договорились почти до всего. Это последние уступки, на которые я могу пойти. Принимайте решение или расходимся!',
    ActionBall: 2,
    ActionComment: '',
    ActionNext: 15
  }, {
    ActionID: 'app1D13R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович, наш проект очень важен для компании и нам необходимо договориться. Мы с вами продуктивно поработали два часа и выработали массу различных вариантов финальных договоренностей. Очевидно, что текущие оптимальны (перечисление), предлагаю принять их и начать работать. ',
    ActionBall: 5,
    ActionComment: '',
    ActionNext: 15
  }, {
    ActionID: 'app1D13R4',
    ActionIdx: 4,
    ActionText: 'Виктор Иванович, наш проект очень важен для компании, и нам необходимо договориться. Иначе нас может заставлять договориться директор, а вы понимаете, чем это закончится. ',
    ActionBall: 4,
    ActionComment: ' ',
    ActionNext: 15
  }]
}, {
  ModuleNodeId: 'app1D14',
  ModuleNodeIndex: 13,
  ModuleNodeText: '  <div class="CaseDialog1" > \u0423 \u0432\u0430\u0441 \u0447\u0435\u0442\u044B\u0440\u0435 \u0432\u0430\u0440\u0438\u0430\u043D\u0442\u044B \u0430\u0440\u0433\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u0438 \u0441\u0432\u043E\u0435\u0439 \u043F\u043E\u0437\u0438\u0446\u0438\u0438, \u0447\u0442\u043E \u0432\u044B \u0432\u044B\u0431\u0435\u0440\u0435\u0442\u0435? </div> ',
  ModuleNodeParams: [{
    ActionID: 'app1D12R1',
    ActionIdx: 1,
    ActionText: 'Я считаю, что здесь и обсуждать нечего этот вариант самый лучший! Виктор Иванович, соглашайтесь! ',
    ActionBall: 3,
    ActionComment: '',
    ActionNext: 15
  }, {
    ActionID: 'app1D14R2',
    ActionIdx: 2,
    ActionText: 'Виктор Иванович, мы с вами потратили 2 часа своего времени на сложные переговоры и договорились почти до всего. Это последние уступки, на которые я могу пойти. Принимайте решение или расходимся!',
    ActionBall: 2,
    ActionComment: '',
    ActionNext: 15
  }, {
    ActionID: 'app1D14R3',
    ActionIdx: 3,
    ActionText: 'Виктор Иванович, наш проект очень важен для компании и нам необходимо договориться. Мы с вами продуктивно поработали два часа и выработали массу различных вариантов финальных договоренностей. Очевидно, что текущие оптимальны (перечисление), предлагаю принять их и начать работать. ',
    ActionBall: 5,
    ActionComment: '',
    ActionNext: 15
  }, {
    ActionID: 'app1D14R4',
    ActionIdx: 4,
    ActionText: 'Виктор Иванович, наш проект очень важен для компании, и нам необходимо договориться. Иначе нас может заставлять договориться директор, а вы понимаете, чем это закончится. ',
    ActionBall: 4,
    ActionComment: ' ',
    ActionNext: 15
  }]
}, {
  ModuleNodeId: 'app1D15',
  ModuleNodeIndex: 14,
  ModuleNodeText: ' <div class="CaseDialog1"> \u0412\u044B \u0432\u0435\u0440\u043D\u0443\u043B\u0438\u0441\u044C \u0432 \u0441\u0432\u043E\u0439 \u043E\u0444\u0438\u0441 \u0438 \u0432\u0430\u0441 \u043E\u0431\u0441\u0442\u0443\u043F\u0438\u043B\u0438 \u043D\u0430\u0447\u0430\u043B\u044C\u043D\u0438\u043A\u0438 \u043E\u0442\u0434\u0435\u043B\u043E\u0432 \u0441 \u0432\u043E\u043F\u0440\u043E\u0441\u0430\u043C\u0438 \u043E \u0442\u043E\u043C, \u043A\u0430\u043A \u043F\u0440\u043E\u0448\u043B\u0438 \u043F\u0435\u0440\u0435\u0433\u043E\u0432\u043E\u0440\u044B \u0441 \u0421\u0430\u043C\u0435\u0434\u043E\u0432\u044B\u043C.</div>',
  ModuleNodeParams: [{
    ActionID: 'app1D15R1',
    ActionIdx: 1,
    ActionText: 'Да все прошло отлично. Два часа пришлось попотеть, Виктор Иванович отличный переговорщик. Сейчас положим все на бумагу, и я вас ознакомлю.',
    ActionBall: 5,
    ActionComment: '',
    ActionNext: 999
  }, {
    ActionID: 'app1D15R2',
    ActionIdx: 2,
    ActionText: 'Идите и  работайте, какая разница до чего договорились начальники? Из протокола все узнаете.',
    ActionBall: 2,
    ActionComment: '',
    ActionNext: 999
  }, {
    ActionID: 'app1D15R3',
    ActionIdx: 3,
    ActionText: 'Да с этим индюком еле договорился, два часа пришлось попотеть. Сейчас положим все на бумагу, и я вас ознакомлю.',
    ActionBall: 3,
    ActionComment: '',
    ActionNext: 999
  }, {
    ActionID: 'app1D15R4',
    ActionIdx: 4,
    ActionText: 'Да все прошло отлично. Сейчас положим все на бумагу, и я вас ознакомлю.',
    ActionBall: 4,
    ActionComment: ' ',
    ActionNext: 999
  }]
}]);
// CONCATENATED MODULE: ./node_modules/babel-loader/lib!./node_modules/vue-loader/lib/selector.js?type=script&index=0!./src/pages/casePageForm.vue






/* harmony default export */ var casePageForm = ({
  data: function data() {
    return {
      src: '',
      selOpt: '',
      curModIdx: 0,
      arrAnswers: [],
      curQNum: 1,
      curQstrId: '',
      itogBall: 0,
      tblCurCase: CaseParameters
    };
  },

  methods: {
    makeStep: function makeStep() {
      var _this = this;

      if (this.selOpt == '') {
        this.notify();
      } else {
        this.src = CaseParameters[curModIdx].ModuleNodeParams;

        this.curQstrId = 'app1D' + this.curQNum;
        var picked = CaseParameters.find(function (o) {
          return o.ModuleNodeId === _this.curQstrId;
        });
        this.arrAnswers[this.curModIdx] = this.selOpt;

        this.selOpt = '';
        this.curModIdx++;
      }
    },
    notify: function notify() {
      this.$q.notify({
        message: 'Не выбран ответ',
        detail: 'Для продолжения упражнения необходимо выбрать вариант ответа',
        timeout: 2000,
        type: 'warning',

        color: 'positive',
        textColor: 'black',
        icon: 'perm_identity',
        position: 'bottom' });
    }
  }
});
// CONCATENATED MODULE: ./node_modules/vue-loader/lib/template-compiler?{"id":"data-v-d69c823e","hasScoped":false,"optionsId":"0","buble":{"transforms":{}}}!./node_modules/vue-loader/lib/selector.js?type=template&index=0!./src/pages/casePageForm.vue
var render = function() {
  var _vm = this
  var _h = _vm.$createElement
  var _c = _vm._self._c || _h
  return _c("q-page", { staticClass: "row justify", attrs: { padding: "" } }, [
    _c("div", { staticClass: "doc-container" }, [
      _c("span", {
        domProps: {
          innerHTML: _vm._s(_vm.tblCurCase[_vm.curModIdx].ModuleNodeText)
        }
      }),
      _vm._v(" "),
      _c(
        "div",
        { staticClass: "row justify-center" },
        [
          _c(
            "q-list",
            {
              staticStyle: { width: "80vw", "max-width": "90vw" },
              attrs: { "inset-separator": "" }
            },
            [
              _c("q-list-header", [_vm._v("Каким будет ваш ответ?")]),
              _vm._v(" "),
              _vm._l(_vm.tblCurCase[_vm.curModIdx].ModuleNodeParams, function(
                oneVar
              ) {
                return _c(
                  "q-item",
                  { key: oneVar.ActionIdx, attrs: { link: "", tag: "label" } },
                  [
                    _c(
                      "q-item-side",
                      [
                        _c("q-radio", {
                          attrs: { val: oneVar.ActionIdx },
                          model: {
                            value: _vm.selOpt,
                            callback: function($$v) {
                              _vm.selOpt = $$v
                            },
                            expression: "selOpt"
                          }
                        })
                      ],
                      1
                    ),
                    _vm._v(" "),
                    _c("q-item-main", {
                      staticClass: "CaseAnswerItem",
                      attrs: { label: oneVar.ActionText }
                    })
                  ],
                  1
                )
              })
            ],
            2
          )
        ],
        1
      ),
      _vm._v(" "),
      _c(
        "div",
        { staticClass: "text-center q-pt-lg" },
        [
          _c("q-btn", {
            attrs: { color: "primary", size: "lg", label: "Далее" },
            on: { click: _vm.makeStep }
          }),
          _vm._v(" "),
          _c("p", [_vm._v("Class ")]),
          _vm._v(
            "\n      arrAnswers " +
              _vm._s(_vm.arrAnswers) +
              "\n     selOpt  " +
              _vm._s(_vm.selOpt) +
              " \n     curModIdx " +
              _vm._s(_vm.curModIdx) +
              "\n     curQstrId " +
              _vm._s(_vm.curQstrId) +
              " \n     src " +
              _vm._s(_vm.src) +
              "\n\n     ingng " +
              _vm._s(_vm.ingng) +
              "\n    "
          )
        ],
        1
      )
    ])
  ])
}
var staticRenderFns = []
render._withStripped = true

if (false) {
  module.hot.accept()
  if (module.hot.data) {
    require("vue-hot-reload-api")      .rerender("data-v-d69c823e", { render: render, staticRenderFns: staticRenderFns })
  }
}
// EXTERNAL MODULE: ./node_modules/vue-loader/lib/runtime/component-normalizer.js
var component_normalizer = __webpack_require__("XyMi");

// CONCATENATED MODULE: ./src/pages/casePageForm.vue
var disposed = false
function injectStyle (context) {
  if (disposed) return
  __webpack_require__("1uSB")
}
/* script */


/* template */

/* template functional */
var __vue_template_functional__ = false
/* styles */
var __vue_styles__ = injectStyle
/* scopeId */
var __vue_scopeId__ = null
/* moduleIdentifier (server only) */
var __vue_module_identifier__ = null

var Component = Object(component_normalizer["a" /* default */])(
  casePageForm,
  render,
  staticRenderFns,
  __vue_template_functional__,
  __vue_styles__,
  __vue_scopeId__,
  __vue_module_identifier__
)
Component.options.__file = "src\\pages\\casePageForm.vue"

/* hot reload */
if (false) {(function () {
  var hotAPI = require("vue-hot-reload-api")
  hotAPI.install(require("vue"), false)
  if (!hotAPI.compatible) return
  module.hot.accept()
  if (!module.hot.data) {
    hotAPI.createRecord("data-v-d69c823e", Component.options)
  } else {
    hotAPI.reload("data-v-d69c823e", Component.options)
  }
  module.hot.dispose(function (data) {
    disposed = true
  })
})()}

/* harmony default export */ var pages_casePageForm = __webpack_exports__["default"] = (Component.exports);


/***/ })

});
//# sourceMappingURL=7.693655391f716ef8c794.js.map